{
  "paperId": "02319ec3fafbe141df42a522b1c2eabda500d495",
  "externalIds": {
    "DOI": "10.1088/1755-1315/327/1/011001",
    "CorpusId": 243328538
  },
  "url": "https://www.semanticscholar.org/paper/02319ec3fafbe141df42a522b1c2eabda500d495",
  "title": "Preface",
  "venue": "IOP Conference Series: Earth and Environment",
  "year": 2019,
  "citationCount": 0,
  "influentialCitationCount": 0,
  "openAccessPdf": {
    "url": "https://doi.org/10.1088/1755-1315/327/1/011001",
    "status": "GOLD",
    "license": null,
    "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1088/1755-1315/327/1/011001?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1088/1755-1315/327/1/011001, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "fieldsOfStudy": [
    "Physics"
  ],
  "publicationTypes": [
    "Conference",
    "Review"
  ],
  "authors": [],
  "abstract": "This proceeding contains the manuscripts which selected in International Conference on Sustainable Agriculture, that held on 13 th – 14th of November 2018 at Andalas University, West Sumatera, Indonesia. This conference was organized by Faculty of Agricultural Technology, Andalas University in collaboration with Universiti Teknologi MARA, Malaysia and Chiang Mai University, Thailand. The main topic of conference is sustainable agriculture and divided into three specified themes, they are Socio-Economics Value Chains in Agricultural System, Precision and Smart Technologies in Agricultural System, and Sustainable Agricultural System Organic Farming Diversified. There were 71 papers that had been presented orally and poster during conference. 29 of 71 papers have been selected after reviewing by authorized reviewers. The selected papers are published in IOP conference series: Earth and Environmental Sciences. Lastly, Our team would like to express our sincere thanks and appreciation to all the participants, colleagues as well as Andalas University administration for their indispensable support in organizing this scientific meeting and publisher (IOP Publishing) which accepted our manuscripts for publishing. Dr. Ir. Feri Arlius, M.Sc Chairman of the ICSA 2018",
  "references": []
}