{
  "paperId": "09e3a8a1ab55b399472bcf68f15760ee7697b3ef",
  "externalIds": {
    "MAG": "2905400012",
    "DOI": "10.1139/cjas-2018-0140",
    "CorpusId": 198234812
  },
  "url": "https://www.semanticscholar.org/paper/09e3a8a1ab55b399472bcf68f15760ee7697b3ef",
  "title": "Summaries of Communications",
  "venue": "Canadian Journal of Animal Science",
  "year": 2018,
  "citationCount": 0,
  "influentialCitationCount": 0,
  "openAccessPdf": {
    "url": "https://doi.org/10.1139/cjas-2018-0140",
    "status": "BRONZE",
    "license": null,
    "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'references'}. Paper or abstract available at https://api.unpaywall.org/v2/10.1139/cjas-2018-0140?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1139/cjas-2018-0140, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "fieldsOfStudy": [
    "Chemistry",
    "Biology"
  ],
  "publicationTypes": [
    "Review"
  ],
  "authors": [
    {
      "authorId": "2268255335",
      "name": "Maciej M. Misiura"
    },
    {
      "authorId": "2370002720",
      "name": "Jan Filipe"
    },
    {
      "authorId": "2370006279",
      "name": "Carrie L Walk"
    },
    {
      "authorId": "2237550135",
      "name": "I. Kyriazakis"
    }
  ],
  "abstract": "Summaries of Communications Proceedings of the 2018 Meeting of the Animal Science Modelling Group E. Kebreab, J. France, J.A. Metcalf, and R.R. White Department of Animal Science, University of California, Davis, CA 95616, USA. Centre for Nutrition Modelling, Department of Animal Biosciences, University of Guelph, Guelph, ON N1G 2W1, Canada. Trouw Nutrition AgResearch Canada, 150 Research Lane, Guelph, ON N1G 4T2, Canada. Department of Animal and Poultry Sciences, Virginia Tech, Blacksburg, VA 24061, USA. This group meets approximately yearly for one-day meetings. The 2018 meeting was sponsored by Trouw Nutrition, Guelph, ON, Canada; Ajinomoto Heartland, Inc., Chicago, IL, USA; and Lallemand Specialties, Inc., Milwaukee, WI, USA. It was held on June 23 at Holiday Inn Knoxville Downtown — Worlds Fair Park, 525 Henley Street, Knoxville, TN 37902, prior to the ADSA Annual Meeting. Summaries of the papers presented follow. Each summary has been peer reviewed and edited for clarity. The lead author of the summary is the person who presented the paper. A Bayesian framework for meta-analysis using nonlinear models L.E. Moraes Department of Animal Sciences, The Ohio State University, 2029 Fyffe Road, Columbus, OH 43210, USA. Modelling growth data and animal responses to nutrient supply often rely on diminishing returns and sigmoidal functions. Estimation of parameters for models that are nonlinear with respect to the parameters, frequently rely on algorithms because closed form solutions are usually not available. Meta-analyses require mixed-effects models that account for both between and within study variances (St-Pierre 2001). The situation becomes particularly challenging with nonlinear mixed-effects models because the marginal likelihood function of the data, obtained by integrating out the random effects from the joint density of the data and random effects, usually does not have a closed form expression (Pinheiro and Bates 2000). Lack of algorithm convergence is common in the animal sciences and nonlinear models that ignore the meta-analytic design are often estimated using nonlinear regression. The objective of this study was to develop a framework to conduct meta-analysis with nonlinear functional forms. A Bayesian hierarchical modeling approach is proposed to introduce between study variability into the parameters of the nonlinear model and represent heterogeneous error variances. Alternative settings for prior distributions and strategies to improve computational efficiency and numerical stability are proposed within our framework, such as constructing the model for the between-study variability using a Cholesky decomposition. An example of the framework is presented with a bi-substrate Michaelis–Menten model developed to predict microbial protein production in the rumen from the supply of rumen-degradable protein, rumendegradable starch, and rumen-degradable fiber. References Pinheiro, J., and Bates, D.M. 2000. Mixed effects models in S and SPLUS. Statistics and computing. Springer, New York, NY, USA. St-Pierre, N.R. 2001. Integrating quantitative findings frommultiple studies using mixed model methodology. J. Dairy Sci. 84: 741–755. doi:10.3168/jds.S0022-0302(01)74530-4. Balancing essential amino acid fluxes through the post-absorptive tissues in dairy cows A.J. Fleming, H. Lapierre, R. Martineau, and M.D. Hanigan Department of Dairy Science, Virginia Tech, Blacksburg, VA 24061, USA. Agricultural and Agri-Food Canada, Sherbrooke, QC J1M 0C8, Canada. Essential amino acids (EAA) play a significant role not only in terms of their nutritional availability but also due to their importance in mammary synthesis of milk protein (Bequette and Nelson 2006). To accurately determine mammary EAA supply, one needs to predict utilization by the other post-absorptive tissues. The objective was to evaluate predictions of EAA use by portal-drained viscera (PDV), liver (LIV), mammary (MAM), and the aggregated remaining tissues (OTH). The general equation forms were as follows: FPDVuseðAAÞ = FAbsðAAÞ + FPAðAAÞ − ððFAbsðAAÞ + FPAðAAÞÞ=ðKPDVðAAÞ + BFPAÞÞ × BFPA FLIVuseðAAÞ = FHAðAAÞ + FPVðAAÞ − ððFHAðAAÞ + FPVðAAÞÞ=ðKLIVðAAÞ + BFHVÞÞ × BFHV FMAMuseðAAÞ = FMAðAAÞ − ðFMAðAAÞ=ðKMAMðAAÞ + BFMAÞÞ × BFMA FOTHuseðAAÞ = FAbsðAAÞ − FPDVuseðAAÞ − FLIVuseðAAÞ − FMAMuseðAAÞ where F represents flux; K represents the clearance rate constants; Abs represents absorption; PA, HA, andMA represent portal, hepatic, and mammary arteries, respectively; PV and HV represent portal and hepatic veins, respectively; and BF represents blood flow. Venous fluxes were predicted with high accuracy and precision having concordance correlation coefficients ranging from 0.78 to 0.99 across EAA. Surprisingly, FOTHuse was negative for all EAA except methionine, ranging from 0.01 to −0.27 mol d suggesting that AA balance was negative for most treatments. Resolution of the problem will allow derivation of use parameters for OTH and subsequently predictions of arterial concentrations using only FAbs as an input. References Bequette, B.J., and Nelson, K. 2006. The roles of amino acids in milk yield and components. In Proc. Florida Ruminant Nutrition Symposium. Best Western Gateway Grand, Gainesville, FL, USA. Effects of varying extracellular amino acid concentration on amino acid transport in mammary epithelial cells P.S. Yoder, J.J. Castro, Tatiana Ruiz-Cortes, and M.D. Hanigan Department of Dairy Science, Virginia Tech, Blacksburg, VA 24061, USA. Perdue AgriBusiness, Salisbury, MD 21804, USA. Dairy Visions LLC, Chandler, AZ 85249, USA. Biogenesis Research Group, Faculty of Agricultural Sciences, University of Antioquia, Medellin 050010, Colombia. Copyright remains with the author(s) or their institution(s). Permission for reuse (free in most cases) can be obtained from RightsLink. 902 Can. J. Anim. Sci. 98: 902–906 (2018) dx.doi.org/10.1139/cjas-2018-0140 Published at www.nrcresearchpress.com/cjas on 28 November 2018. Understanding mechanisms and quantitative description of cellular responses to changing nutrient supply are critical for predicting milk component yields. Our objective was to evaluate cellular uptake and kinetic behavior of varied extracellular concentrations of individual amino acids (AA) simultaneously. Bovine mammary epithelial cells were the subjects. Treatments were four AA concentrations, 0.36, 2.30, 4.28, and 6.24 mmol L. Twenty-four plates of cells (100 mm × 20 mm) were assigned to each treatment. Cells were first subjected to treatment media enriched with N labelled AA for 24 h and then incubated with treatment media enriched with C labelled AA for 0, 15, 60, 300, 900, 1800, and 3600 s. Intracellular free AA, intracellular protein-bound AA, and extracellular media AA were analyzed for concentrations and isotopic enrichment. A dynamic 9-pool model was constructed representing extracellular, intracellular, and turnover pools for individual AA and respective isotopes. Fluxes were extracellular to intracellular, intracellular efflux, protein turnover, transamination, oxidation, and synthesis. As an example, cellular influx and efflux ranged from 0.9 to 11.1 and 0 to 9.5 nmol min for leucine (Leu), whereas alanine (Ala) ranged from 1.6 to 50.0 and 0.9 to 56.9 nmol min for influx and efflux. The average root mean square prediction error for the nine pools was 14.6% and 10.6% for Leu and Ala, respectively. When AA influx was standardized to total pool of the respective AA, Michaelis–Menten kinetics were observed with a Km of 72 and 345 μmol for Leu and Ala, respectively. The described model provides insight on individual AA transport kinetics. Comparison of nonlinear models to estimate N partitioning kinetics into milk, urine, and feces of lactating dairy cows from individually labeled feed ingredients K.F. Reed, T. Barros, J.M. Powell, G.I. Zanton, and M.A. Wattiaux USDA-Agricultural Research Service, US Dairy Forage Research Center, Madison, WI 53706, USA. Deptartment of Dairy Science, University of Wisconsin-Madison, Madison, WI 53706, USA. The objective was to estimate the fractional rate of excretion (k) and maximum enrichment (A) of feed N in excreta and milk. Corn silage, alfalfa silage, corn grain, and soybean meal (SBM) enriched with N were fed in four diets to 12 cows for 4 d as described by Powell et al. (2017). Cows were fed once andmilked twice daily; total collection of urine and faeces occurred at 6 h intervals during the 4 d enrichment and 4 d decay period. Samples were analyzed for N atom percent excess. The following four models were compared: (1) exponential enrichment model, (2) exponential decay model, (3) piece-wise, complete data exponential model, and (4) logistic enrichment model. Models were fitted with the nlme package in R statistical software, and differences between diets were tested using the multcomp package (H0: θi= θi’ vs. H1: θi ≠ θi’, where θi = Ai or ki). All models except model 2 resulted in the same estimates of dietary order and significant differences for A (P≤ 0.1). All models estimated faecal N k was greater for silages than grains. Models 1 and 4 had similar estimates of urinary N k; models 2 and 3 had no significant differences. Milk N enrichment k estimates varied greatly: models 1 and 4 indicated SBM has the fastest enrichment, and model 3 estimated SBM has the slowest decay rate. Also, variation in k between enrichment and decay for milk and urine N, but not faecal N, and a slow turnover metabolic pool are aspects requiring further investigation. References Powell, J.M., Barros, T., Danes, M., Aguerre, M., Wattiaux, M., and Reed, K.F. 2017. Nitrogen use efficiencies to grow, feed, and recycle manure from the major diet components fed to dairy cows in the USA. Agric. Ecosyst. Environ. 239: 274–282. doi:10.1016/j.agee.2017.01.023. Empirical models to predict duodenal B-vitamin supply in lactating dairy cattle D.S. Castagnino, J.L. Ellis, J. France, C.L. Girard, and J.A. Metcalf Trouw Nutrition Agresear",
  "references": null
}