{
  "paperId": "0f35204deb958d6a5f7894554bb8aa9ecab3052d",
  "externalIds": {
    "MAG": "2805475117",
    "DBLP": "conf/rss/KayacanZC18",
    "DOI": "10.15607/RSS.2018.XIV.036",
    "CorpusId": 46966293
  },
  "url": "https://www.semanticscholar.org/paper/0f35204deb958d6a5f7894554bb8aa9ecab3052d",
  "title": "Embedded High Precision Control and Corn Stand Counting Algorithms for an Ultra-Compact 3D Printed Field Robot",
  "venue": "Robotics: Science and Systems",
  "year": 2018,
  "citationCount": 51,
  "influentialCitationCount": 3,
  "openAccessPdf": {
    "url": "https://doi.org/10.15607/rss.2018.xiv.036",
    "status": "BRONZE",
    "license": null,
    "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'references'}. Paper or abstract available at https://api.unpaywall.org/v2/10.15607/RSS.2018.XIV.036?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.15607/RSS.2018.XIV.036, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "fieldsOfStudy": [
    "Computer Science"
  ],
  "publicationTypes": [
    "JournalArticle"
  ],
  "authors": [
    {
      "authorId": "2487386",
      "name": "E. Kayacan"
    },
    {
      "authorId": "152781025",
      "name": "Zhong-Zhong Zhang"
    },
    {
      "authorId": "1733356",
      "name": "Girish V. Chowdhary"
    }
  ],
  "abstract": "This paper presents embedded high precision control and corn stands counting algorithms for a low-cost, ultracompact 3D printed and autonomous field robot for agricultural operations. Currently, plant traits, such as emergence rate, biomass, vigor and stand counting are measured manually. This is highly labor intensive and prone to errors. The robot, termed TerraSentia, is designed to automate the measurement of plant traits for efficient phenotyping as an alternative to manual measurements. In this paper, we formulate a Nonlinear Moving Horizon Estimator (NMHE) that identifies key terrain parameters using onboard robot sensors and a learning-based Nonlinear Model Predictive Control (NMPC) that ensures high precision path tracking in the presence of unknown wheel-terrain interaction. Moreover, we develop a machine vision algorithm to enable TerraSentia to count corn stands by driving through the fields autonomously. We present results of an extensive field-test study that shows that (i) the robot can track paths precisely with less than 5 cm error so that the robot is less likely to damage plants, and (ii) the machine vision algorithm is robust against interferences from leaves and weeds, and the system has been verified in corn fields at the growth stage of V4, V6, VT, R2, and R6 from five different locations. The robot predictions agree well with the ground truth with countrobot = 0.96× counthuman + 0.85 and correlation coefficient R = 0.96.",
  "references": null
}