{
  "paperId": "15c9b71c1dba346741268872e90ed1899b0c1d4c",
  "externalIds": {
    "MAG": "2202433574",
    "DOI": "10.1659/mrd.mm157",
    "CorpusId": 146648224
  },
  "url": "https://www.semanticscholar.org/paper/15c9b71c1dba346741268872e90ed1899b0c1d4c",
  "title": "Naturressourcennutzung im Kontext struktureller Unsicherheiten: Eine Politische Ökologie der Weideländer Kirgisistans in Zeiten gesellschaftlicher Umbrüche [Natural Resource Use in a Context of Structural Insecurity: A Political Ecology of Kyrgyztan's Pastures in Times of Radical Social Change]",
  "venue": "",
  "year": 2015,
  "citationCount": 0,
  "influentialCitationCount": 0,
  "openAccessPdf": {
    "url": "https://bioone.org/journals/Mountain-Research-and-Development/volume-35/issue-2/mrd.mm157/Naturressourcennutzung-im-Kontext-struktureller-Unsicherheiten--Eine-Politische-%c3%96kologie-der/10.1659/mrd.mm157.pdf",
    "status": "GOLD",
    "license": "CCBY",
    "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1659/mrd.mm157?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1659/mrd.mm157, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "fieldsOfStudy": [
    "Sociology"
  ],
  "publicationTypes": [
    "Review"
  ],
  "authors": [
    {
      "authorId": "47234499",
      "name": "K. Liechti"
    }
  ],
  "abstract": "Understanding pasture governance in transformation societies, above all in the post-Soviet context, is a demanding and thus very interesting task. I speak from my own experience of trying to understand current practices and related challenges: this is not possible unless we delve deep into both history and the specific local situation. Andrei Dörre has embraced this challenge and succeeded in giving a broad overview of what is at stake today in Kyrgyz resource governance. But why focus on pastures? Pastures are the largest land use category in Kyrgyzstan, and livestock breeding has become a major source of income for much of the rural population. Accordingly, pasture-related social and environmental problems have a direct impact on people’s livelihoods, and this implies a certain urgency to understand their context and find solutions. This book is a valuable basis, above all, for understanding the diverse factors that influence the concrete situation on the ground. The book opens with a chapter on structural social insecurities in postSoviet Kyrgyzstan, with the main focus on shortcomings in terms of governance and participation. The second chapter introduces the characteristics of Kyrgyz pasturelands and related social and ecological challenges. The subsequent extended chapter on concepts and methods of analysis—in which the author explains his understanding of transformation, the chosen analytical framework of political ecology, and the methods he used—presumably results from the fact that the book is based on a doctoral dissertation. Next, the author zooms in on pasture use and related challenges in the walnut region in Bazar Korgon district, southwestern Kyrgyzstan, where he did his fieldwork. Due to its large wooded areas, this region is not necessarily representative of major parts of the country. Nonetheless, by describing the particularities of pasture use in this area, the subsequent chapters offer valuable insights into governance mechanisms and related challenges that exist throughout Kyrgyzstan. The chapter on the historical preconditions of current pasture challenges is one of the most interesting, showing in detail and with precision which historical events may have had long-term effects on pasture use. In the khanates of the preRussian era, for example, pasture use was in the hands of powerful leaders. They organized it not by allocating fixed areas but predominantly by negotiating ‘‘rights to move’’ with other leaders according to the ecological condition of the pastures in question. The geopolitically and economically motivated colonial conquest of Central Asia by the Russian Empire in the 19th century marked the beginning of mobile livestock owners’ assignment to fixed pasture areas. This development was driven above all by considerations of fiscal registration and control. With the establishment of Soviet power in the 20th century and the paradigm shift towards intensification, means of production—such as pastureland, livestock, or infrastructure—were converted into state or collective property, and many people were withdrawn from livestock breeding and agriculture to work in other economic sectors. Dörre concludes that one commonality of the different historical eras since the Russian colonization is that pasture use systems were always governed by external interventions and based on ideas of development. In the last large chapter, the author analyzes current pasture use from a political ecology perspective, providing detailed insights into the challenges faced today in the walnut region. Among the most prominent are conflicts over access to pasture resources, competition for their use, inadequate management, and pasture degradation. Dörre names a number of root causes, including: a lack of alternative income opportunities; structural inadequacies within the institutions responsible for resource management and the allocation of pasture entitlements; pasture legislation that is partly inadequate in the local context; a lack of awareness among many pasture users of the relevant legal relationships; and a concurrent unreliability of the judiciary. He also argues that the fragmentation with regard to patterns, practices, and intensities of pasture use can be interpreted as a reflection of Kyrgyzstan’s socioeconomically stratified postsocialist society. The arguments in this chapter are brought to life by several portraits of individual pasture users: the story of a former librarian and forester, for example, illustrates how the collapse of the Soviet system changed his family’s livelihood. Due to the loss of his former secure position and regular income, they now depend on a mixture of maize and potato cultivation, forest product harvesting, child allowances, pasturing services for relatives and friends, and the sale of livestock products. Since he has no lease agreement for the use of summer pastures, he regularly has to obtain permission from the forestry administration. Along with payment of MountainMedia Mountain Research and Development (MRD) An international, peer-reviewed open access journal published by the International Mountain Society (IMS) www.mrd-journal.org",
  "references": []
}