{
  "paperId": "24682465bd6eb9e54e97ed2eadc65839017e8537",
  "externalIds": {
    "MAG": "2991822736",
    "DOI": "10.52151/jae2010474.1423",
    "CorpusId": 220863997
  },
  "url": "https://www.semanticscholar.org/paper/24682465bd6eb9e54e97ed2eadc65839017e8537",
  "title": "Computer Vision – A Versatile Technology in Automation of Agricultural Machinery",
  "venue": "Journal of Agricultural Engineering",
  "year": 2010,
  "citationCount": 5,
  "influentialCitationCount": 0,
  "openAccessPdf": {
    "url": "",
    "status": "CLOSED",
    "license": null,
    "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'references'}. Paper or abstract available at https://api.unpaywall.org/v2/10.52151/jae2010474.1423?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.52151/jae2010474.1423, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "fieldsOfStudy": [
    "Engineering"
  ],
  "publicationTypes": [
    "JournalArticle"
  ],
  "authors": [
    {
      "authorId": "2066619519",
      "name": "Jens-Uwe Möller"
    }
  ],
  "abstract": "The agricultural market in developed countries is evolving from being mechanised in the 20th century, with still larger machines being automated in the 21st century. Development of automation technology for agricultural machinery includes many aspects. As the degree of automation increases, the complexity of automation would rise. The paper focuses on the sensor sub-system, and more specifically, computer vision technology. The emergence of widely available vision technologies has enabled the manufacturers to automate a wide range of tasks. Weed control and auto-guidance systems are two areas in agriculture that have driven the development of vision technology. Applying computer vision technology makes it possible to automate the navigation tasks when the vehicle is driven along crops and other field structures. The operator stress level can be generally reduced and high precision steering in sensitive crops can be maintained through out the day. The driver can concentrate on optimizing the machine settings and ensure a safe operation of the system. Machine settings can be optimised yielding a higher quality in the field operations. The working speed can be increased, thus saving time and money.",
  "references": null
}