{
  "paperId": "30802c91468cab85627a79955c6c713bd36f63f3",
  "externalIds": {
    "MAG": "2945951962",
    "DOI": "10.1088/1755-1315/275/1/012001",
    "CorpusId": 182079791
  },
  "url": "https://www.semanticscholar.org/paper/30802c91468cab85627a79955c6c713bd36f63f3",
  "title": "Challenges of multi/hyper spectral images in precision agriculture applications",
  "venue": "IOP Conference Series: Earth and Environment",
  "year": 2019,
  "citationCount": 15,
  "influentialCitationCount": 0,
  "openAccessPdf": {
    "url": "https://doi.org/10.1088/1755-1315/275/1/012001",
    "status": "GOLD",
    "license": null,
    "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1088/1755-1315/275/1/012001?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1088/1755-1315/275/1/012001, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "fieldsOfStudy": [
    "Computer Science",
    "Physics"
  ],
  "publicationTypes": [
    "Conference"
  ],
  "authors": [
    {
      "authorId": "1679246",
      "name": "A. Mancini"
    },
    {
      "authorId": "1721130",
      "name": "E. Frontoni"
    },
    {
      "authorId": "1695800",
      "name": "P. Zingaretti"
    }
  ],
  "abstract": "According to the CEMA, Agriculture 4.0 paves the way for the next evolution of farming consisting of unmanned operations and autonomous decision systems while Agriculture 5.0 will be based around robotics and (some form of) artificial intelligence. It is clear how Agriculture is experimenting a Copernican Revolution where multidisciplinarity is the engine of this revolution. In this context it is central the topic of Variable Rate Treatments (VRTs). A VRT application relies on prescription maps that are generated by considering the agronomist experience augmented with data sensed also by using advanced platform as Unmanned Aerial Vehicles (UAVs) or satellites. Prescription maps are usually implemented by tractors using Variable Rate Controllers (VRCs) that apply a given quantity of product on a given region. The typical operation is spraying nitrogen or weed treatment application over the agricultural field. The generation of a correct prescription map requires the definition of specific management zones that reflect areas and their status. The planning of agricultural tasks necessitates a deep knowledge of crop state, for example, an important but typical case is variable rate nitrogen fertilizer application. In this scenario multi-spectral images play a key role and today the technology is mature to be used also in real applications. Hyper-spectral imagery is still expensive and it is usually adopted for advanced research considering the complexity to acquire and post-process data. However multi and hyper spectral systems are changing the agriculture enabling complex analysis with ultra high spatial and spectral resolution.",
  "references": [
    {
      "paperId": "33043db19af77178614bfbe10e6fc1921116154b"
    },
    {
      "paperId": "524088ffed19c206f39d17aa1dfcaaa853072509"
    },
    {
      "paperId": "d35ed1fcab47cf98101dc745c42d3b51dace25eb"
    },
    {
      "paperId": "1f73e79a9f2e4475737b44bfd9a7c5e1c4404ed4"
    },
    {
      "paperId": "19582c7f4bae084f17b212b96ef695dc7039d375"
    },
    {
      "paperId": "ac2011cc8637639a81f04754c14398850c1cd6f3"
    },
    {
      "paperId": "ec9a5a8f21ae947eb05eede674f62904975fa665"
    },
    {
      "paperId": "3b350fb33ab840918c87d8383e67a6c6864a1176"
    },
    {
      "paperId": "08b667cae0402f15cda3ddf231e9d8f80aaf54b3"
    },
    {
      "paperId": "6bd0a15e32b7b7a997e42c838cd6f9504e888d5c"
    },
    {
      "paperId": "e3df00b02a21eafb41bf2193b8513457697b3c38"
    },
    {
      "paperId": "36f1cb6c7d1bca5dcfd25a17c8761f00e7ca7588"
    },
    {
      "paperId": "73f28fbe20a88f38687bb784cea136848ccba0b9"
    },
    {
      "paperId": "91791027e06f74bf4f63f31795bfed99c6300d3d"
    },
    {
      "paperId": "24a89f02ea369d740176d1a85acd1252c24e95b9"
    }
  ]
}