{
  "paperId": "4bb63656c4569411afad325386f9ee6ac423bed1",
  "externalIds": {
    "DOI": "10.1002/ird.2325",
    "CorpusId": 240595828
  },
  "url": "https://www.semanticscholar.org/paper/4bb63656c4569411afad325386f9ee6ac423bed1",
  "title": "EDITORIAL",
  "venue": "Irrigation and Drainage",
  "year": 2019,
  "citationCount": 0,
  "influentialCitationCount": 0,
  "openAccessPdf": {
    "url": "",
    "status": "CLOSED",
    "license": null,
    "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'references'}. Paper or abstract available at https://api.unpaywall.org/v2/10.1002/ird.2325?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1002/ird.2325, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "fieldsOfStudy": null,
  "publicationTypes": [
    "Review"
  ],
  "authors": [
    {
      "authorId": "104204493",
      "name": "S. Nairizi"
    }
  ],
  "abstract": "With pleasure I introduce to you this Special Issue of Irrigation and Drainage with selected and reviewed papers of the 23rd International Congress of the International Commission on Irrigation and Drainage (ICID), which was held in October 2017, Mexico City, Mexico, under the Theme: Modernizing irrigation and drainage for a new Green Revolution. In this issue you will find 12 selected papers that have been recommended by the general reporters and organizers of the Congress Questions, Special Session, Symposium and Workshops that were held during the Congress. The issue starts with the Gulhati Memorial Lecture as presented this time by Felipe Ignacio Arreguin Cortes, Managing Director of the Mexican Institute of Water Technology (IMTA), on Reforms in the administration of irrigation systems: Mexican experiences. The paper presents the process and impact of the transfer of the infrastructure, management and operation of irrigation districts in Mexico from the state to farmers. The paper starts with an overview of the present and future conditions of the hydro-agricultural sector in the country, followed by a discussion of the social background and the legal framework under which the transfer process was planned and carried out. The participation and the organizational framework adopted by the users, which not only remains in force, but has been consolidated, giving rise to a social organization that constitutes an example nationwide, is highlighted. In addition, a series of major challenges, problems and opportunities that need to be addressed in order to meet the current and growing food demand prevailing in the country are discussed. Finally, a reflection is given on the importance of the legal framework of water and its impact on the agricultural sector, highlighting the need to have a General Water Law that is applicable both to the three tiers of government that exist in Mexico and to society at large. In each ICID Congress there are two Questions under which papers can be submitted. In this Congress, Questions 60 and 61 were addressed. They concerned the following issues: Question 60:Water productivity: revisiting the concept in light of the water, energy and food nexus, and Question 61: State of knowledge of irrigation techniques and practicalities within given socio-economic settings. The paper by Abdelhafid Debbahr (Morocco) is based on his general report of Question 60. It aims at giving a summary of the main issues covered by the various contributions. This Question was subdivided into: (i) emerging issues and challenges of water saving, including impact of transferring water out of agriculture; (ii) understanding water productivity, water and energy use efficiency and the water footprint of crops; (iii) water security for growth and development. A summary of the main ideas and findings that emerged, for each subtheme mentioned above, is presented. Major conclusions and recommendations are also included at the end of the paper. The paper by Kunlun Ding (China) on the State of knowledge of irrigation techniques and practicalities within given socio-economic settings is based on his General Report of Question 61 of the 23rd Congress on the same theme. The Question covered three sub-questions: (i) adopting precision irrigation and improving surface irrigation to combat water scarcity; (ii) using information and communication technologies (ICT), remote sensing, control systems and modelling for improved performance of irrigation systems; (iii) adaptability and affordability of new technologies under different socio-economic scenarios. Under the Question, 64 accepted papers covering a wide range of topics of irrigation techniques and practicalities were summarized and reviewed with valuable views and state-of-the-art information/knowledge on the topics concerned. It was concluded that improving surface and precision irrigation are still the major areas in which to achieve objectives of higher agricultural water use efficiency and productivity; that new technologies and their applications in the irrigation sector can help to achieve the objectives; and that addressing ‘adaptability and affordability’ would ensure the real value achieved in practice. The technical activities of the International Commission on Irrigation and Drainage (ICID) are organized under four Strategy Themes, namely Knowledge, Schemes, Basin and On-farm. It is a tradition that during each International Executive Council meeting there is a report on one of the Strategy Themes. This time Kunlun Ding presented a report on the Strategy Theme Schemes. This report was prepared in consultation with Ian Makin (United Kingdom) and Irena Bondarik (Russia). The paper was prepared in order to analyse the mandates of the working groups under the Strategy Theme and their appraisal, vision and future directions on the theme, with recommendations for further improvements to enhance the visibility of the technical working groups and further ICID. Two of the best papers on the Questions were selected for this special issue. The first was prepared by Kaluvai Yella Reddy (India) et al. on the theme Adaptation to climate IRRIGATION AND DRAINAGE",
  "references": null
}