{
  "paperId": "563c1aca353da1bd6cf6f04d46b3f5c999fbe5d5",
  "externalIds": {
    "MAG": "2930985619",
    "DOI": "10.15414/afz.2019.22.01.13-16",
    "CorpusId": 133221089
  },
  "url": "https://www.semanticscholar.org/paper/563c1aca353da1bd6cf6f04d46b3f5c999fbe5d5",
  "title": "Selected qualitative parameters above-ground phytomass of the Lenor-first Slovak cultivar of Festulolium A. et Gr.",
  "venue": "Acta Fytotechnica et Zootechnica",
  "year": 2019,
  "citationCount": 0,
  "influentialCitationCount": 0,
  "openAccessPdf": {
    "url": "http://acta.fapz.uniag.sk/journal/index.php/on_line/article/download/471/pdf",
    "status": "GOLD",
    "license": "CCBY",
    "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.15414/afz.2019.22.01.13-16?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.15414/afz.2019.22.01.13-16, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "fieldsOfStudy": [
    "Biology"
  ],
  "publicationTypes": [
    "Review"
  ],
  "authors": [
    {
      "authorId": "2231495",
      "name": "P. Hric"
    },
    {
      "authorId": "87809087",
      "name": "Ľ. Vozár"
    },
    {
      "authorId": "2090256",
      "name": "P. Kovar"
    }
  ],
  "abstract": "Article Details: Received: 2018-10-04 | Accepted: 2018-11-06 | Available online: 2019-01-31 https://doi.org/10.15414/afz.2019.22.01.13-16 The aim of this experiment was to compare selected qualitative parameters in above-ground phytomass of the first Slovak cultivar of Festulolium A et. Gr. cv. Lenor in compare earlier registered cultivars Felina and Hykor. The pot experiment was conducted at the Demonstrating and research base of the Department of Grassland Ecosystems and Forage Crops, Slovak Agricultural University in Nitra (Slovak Republic) with controlled moisture conditions (shelter) in 2017. Content of nitrogen, phosphorus, potassium, calcium, magnesium, crude fiber and water soluble carbohydrates were determined from dry above-ground phytomass of grasses. The significantly highest (P<0.05) nitrogen content in average of cuts was in above-ground phytomass of Felina (30.3 g.kg -1 ) than Hykor (25.4 g.kg -1 ) and new intergeneric hybrid Lenor (25.0 g.kg -1 ). At the least content of phosphorus was found out in hybrid Lenor (3.4 g.kg -1 ). In average of three cuts was the least concentration of potassium in new intergeneric hybrid Lenor (5.8 g.kg -1 ). At least content of calcium was found out in hybrid Lenor (7.0 g.kg -1 ). Magnesium concentration of was from 5.0 g.kg -1 (Hykor) to 6.1 g.kg -1 (Felina). Higher (P<0.05) fiber content in average of cuts was in above-ground phytomass of Lenor (27.0 %) and Hykor (26.5%) than Felina (24.0%). The highest concentration of water soluble carbohydrates has in Hykor and Lenor (3.5%). Keywords: grass hybrids, festulolium, quality References: BASTA, Ľ. (2017) New varieties of red clover and grasses. Our field, vol. 21, no. 7, pp. 26–27 (in Slovak). BIRO, D. et al. (2014) Conservation and adjustment of feeds. 1st ed., Nitra: Slovak University of Agriculture in Nitra (in Slovak). BIRO, D. et al. (2016) Animal nutrition. Nitra: Slovak University of Agriculture in Nitra (in Slovak). CASLER, M.D. et al. (2002) Natural selection for survival improves freezing tolerance, forage yield and persistence of Festulolium. Crop Science, vol. 42, no. 5, pp. 1421–1426. doi: https://doi.org/10.2135/cropsci2002.1421 CERNOCH, V., HOUDEK, I. and CAPKA R. (2004) Festulolium – grass for future. In Bericht uber die 55. Tagung 2004 der Vereinigung der Pflanzenzuchter und Saatgutkaufleute Osterreichs HBLFA Raumberg – Gumpenstein, 23.–25. November 2004, pp. 87–89. CERNOCH, V. and GROENBAEK, O. (2015) Benefits of × Festulolium varieties in European agriculture. In Proceedings of the 18th Symposium of the European Grassland Federation Wageningen 15–17 June 2015. Wageningen Academic Publishers: Wageningen, pp. 386–388. CUNDERLIK, J. and MARTINCOVA, J. (2013) Monitoring the pruduction and qualitative parameters of semi-natural grassland in differentiated nutrition. In Ecology of grassland: Proceedings of scientific works. Piesťany : Plant Production Research Center, pp. 38–42. (in Slovak) GALIK, B. et al. (2016) Nutritional characteristics of feeds. Nitra: Slovak University of agriculture in Nitra (in Slovak). GIBSON, D. J. (2009) Grasses & Grassland Ecology. New York: Osford University Press. HAKL, J. and FUKSA, P. (2011) Production and dietetic effects roughhages. Praha: CZU v Prahe (in Czech). HERKEĽ, R. et al. (2015) The effect of biological additive on nutrient composition of grass silage. Acta fytotechnica et zootechnica, vol. 18, no. 4, pp. 106–109. doi: https://doi. org/10.15414/afz.2015.18.04.106–109 HRIC, P. et al. (2018) Growth-production parameters of the first Slovak cultivar of Festulolium A. et Gr. Acta Universatis Agriculturae et Silviculturae Mendelianae Brunensis, vol. 66, no. 3, pp. 825–828. doi: https://doi.org/10.11118/actaun201866030825 HOUDEK, I. (2010) Perspective species and varieties of grasses and clovers from SS Hladke Životice, s.r.o. In Forage quality of herbaceous and cattle in changing economic conditions: Proceedings from a national scientific conference with international participation. Praha: VURV, pp. 61–67. HOUDEK, I. and JAMBOR. V. (2010) Festulolium Hybrids from Breeding Station Hladke Životice and their Quality. In 14th International Symposium Forage Conservation. March 17–19, Brno : NutriVet Ltd., pp. 22–24. HUMPHREYS, M.W., CANTER, P.J. and THOMAS, H.M. (2003) Advances in introgression technologies for precision breeding within the Lolium-Festuca complex. Annals of Applied Biology, vol. 143, no. 1, pp. 1–10. doi: https://doi.org/10.1111/j.1744-7348.2003.tb00263.x JANCOVIC, J. et al. (2013) The effect of nitrogen fertilization on the grass phytomass quality. Agrochemia – Agrochemistry, vol. 53, no. 2, pp. 3–5 (in Slovak). KOVAC, L., HOUDEK, I. and GEJGUS, J. (2002) The use of grass intergeneric hybrids in specific conditions of East Slovak Lowland. Michalovce: Grafex (in Slovak). MILLER, L. A. et al. (2001) Increasd concentration of watersoluble carbohydrate in perennial reygrass (Lolium perenne L.): milk production from late-lactation dairy cows. Grass and Forage Science, vol. 56, no. 4, pp. 383–384. doi: https://doi.org/10.1046/j.1365-2494.2001.00288.x NESHEIM, L. and BRONSTAD, I. (2000) Yield and winter hardiness of Festulolium (Festuca x Lolium) in Norway. Grassland Science in Europe, 5, pp. 238–240. PROCHNOW, A. et al. (2009) Bioenergy from permanent grassland – a review: 1. Biogas. Bioresource Technolgy, vol. 100, no. 21, pp. 4931–4944. SKLADANKA, J. et al. (2010) Can Festulolium, Dactylis glomerata and Arrhenatherum elatius be used for extension of the autumn grazing season in Central Europe? Plant, Soil and Environment, vol. 56, no. 10, pp. 488–498. doi: https://doi.org/10.17221/91/2010-PSE SKLADANKA, J. et al. (2014) Crop production. Brno: MU (in Czech). STÝBNAROVA, M., PUKYSOVA, V. and MICOVA, P. (2013) Changes in crude fibre and ADF concentration in fodder of orchard grass (Dactylis glomerata L.) under different permanent gassland´s intensity of utilisation. Research in cattle breeding, vol. 55, no. 2, pp. 10–17 (in Czech).",
  "references": [
    {
      "paperId": "c71f540120f0e82f11f77797cadb0f6cb93aa906"
    },
    {
      "paperId": "f918bc00ed4844eed6e3b3411b7f63180b5c6e3f"
    },
    {
      "paperId": "72cb7dda519c881f483e10c7685a1ad81dc5f790"
    },
    {
      "paperId": "e3ee37884842c39daea7fc152813205a67fb4ff5"
    },
    {
      "paperId": "ebb25275925cb3f0fc6e839b2f07dd4a12aaf60a"
    },
    {
      "paperId": "98fdfcae27e634e3c9c65071118d5ba810d4dba3"
    },
    {
      "paperId": "bf3b57ca18c08e8cb644c8d940763d2823985702"
    },
    {
      "paperId": "c7767506cbf4954b85468217c81519c1b06f54ca"
    },
    {
      "paperId": "931e2bf6753564a83045ad3132324d7732847b40"
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    }
  ]
}