{
  "paperId": "5bbbc6709d78fda3048be73cf4049754ed1b5d1f",
  "externalIds": {
    "DBLP": "conf/icc/MiaoLMWZM19",
    "MAG": "2956281646",
    "DOI": "10.1109/ICC.2019.8761505",
    "CorpusId": 198168943
  },
  "url": "https://www.semanticscholar.org/paper/5bbbc6709d78fda3048be73cf4049754ed1b5d1f",
  "title": "Position-Based Beamforming Design for UAV Communications in LTE Networks",
  "venue": "ICC 2019 - 2019 IEEE International Conference on Communications (ICC)",
  "year": 2019,
  "citationCount": 13,
  "influentialCitationCount": 0,
  "openAccessPdf": {
    "url": "",
    "status": null,
    "license": null,
    "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'references'}. Paper or abstract available at https://api.unpaywall.org/v2/10.1109/ICC.2019.8761505?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1109/ICC.2019.8761505, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "fieldsOfStudy": [
    "Computer Science"
  ],
  "publicationTypes": [
    "JournalArticle",
    "Conference"
  ],
  "authors": [
    {
      "authorId": "2136733909",
      "name": "W. Miao"
    },
    {
      "authorId": "37603348",
      "name": "Chunbo Luo"
    },
    {
      "authorId": "145896559",
      "name": "G. Min"
    },
    {
      "authorId": "2112872716",
      "name": "Liang Wu"
    },
    {
      "authorId": "1992724293",
      "name": "Tianxiao Zhao"
    },
    {
      "authorId": "2054302425",
      "name": "Yang Mi"
    }
  ],
  "abstract": "Unmanned Aerial Vehicles (UAVs) have demonstrated exceptional capabilities in many real-world applications such as remote sensing, emergency medicine delivery and precision agriculture. LTE networks are regarded as key candidates to offer high performance broadband wireless services to support UAV applications and safe deployment. However, the unique features of aerial UAVs including high-altitude manipulation, three-dimension (3D) mobility and rapid velocity changes, pose challenging issues for optimising LTE wireless communications to support UAVs, especially under the severe inter-cell interference generated by UAVs in the sky. To deal with this issue, we propose a novel position-based robust beamforming algorithm to improve the performance of LTE networks to serve UAVs. For obtaining optimal weight vectors that could tolerate Direction-of-Arrival (DoA) estimation errors, we propose a hybrid method to integrate the channel information and UAV flight information to accurately estimate the DoA angle range. In order to validate the performance of the proposed robust beamforming algorithm, we conduct comprehensive simulation experiments under practical configurations. The results show that the proposed robust beamforming algorithm outperforms benchmark Linearly Constrained Minimum Variance (LCMV) beamforming and GPS-based beamforming algorithms.",
  "references": null
}