{
  "paperId": "5f4be91a660669d3e45b997065301f4b84ee4aa5",
  "externalIds": {
    "MAG": "2969234820",
    "DOI": "10.1128/AEM.01368-19",
    "CorpusId": 201631288,
    "PubMed": "31444199"
  },
  "url": "https://www.semanticscholar.org/paper/5f4be91a660669d3e45b997065301f4b84ee4aa5",
  "title": "Relative Performance of MinION (Oxford Nanopore Technologies) versus Sequel (Pacific Biosciences) Third-Generation Sequencing Instruments in Identification of Agricultural and Forest Fungal Pathogens",
  "venue": "Applied and Environmental Microbiology",
  "year": 2019,
  "citationCount": 74,
  "influentialCitationCount": 2,
  "openAccessPdf": {
    "url": "https://aem.asm.org/content/aem/85/21/e01368-19.full.pdf",
    "status": "BRONZE",
    "license": null,
    "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'references'}. Paper or abstract available at https://api.unpaywall.org/v2/10.1128/AEM.01368-19?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1128/AEM.01368-19, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "fieldsOfStudy": [
    "Medicine",
    "Biology"
  ],
  "publicationTypes": [
    "JournalArticle"
  ],
  "authors": [
    {
      "authorId": "87469953",
      "name": "K. Loit"
    },
    {
      "authorId": "49897232",
      "name": "K. Adamson"
    },
    {
      "authorId": "49841635",
      "name": "M. Bahram"
    },
    {
      "authorId": "10189494",
      "name": "Rasmus Puusepp"
    },
    {
      "authorId": "7488553",
      "name": "Sten Anslan"
    },
    {
      "authorId": "13757748",
      "name": "R. Kiiker"
    },
    {
      "authorId": "5365148",
      "name": "R. Drenkhan"
    },
    {
      "authorId": "3025949",
      "name": "L. Tedersoo"
    }
  ],
  "abstract": "Microbial pathogens cause enormous losses to agriculture and forestry, but current combined culturing- and molecular identification-based detection methods are too slow for rapid identification and application of countermeasures. Here, we develop new and rapid protocols for Oxford Nanopore MinION-based third-generation diagnostics of plant pathogens that greatly improve the speed of diagnostics. However, due to high error rate and technical biases in MinION, the Pacific BioSciences Sequel platform is more useful for in-depth amplicon-based biodiversity monitoring (metabarcoding) from complex environmental samples. ABSTRACT Culture-based molecular identification methods have revolutionized detection of pathogens, yet these methods are slow and may yield inconclusive results from environmental materials. The second-generation sequencing tools have much-improved precision and sensitivity of detection, but these analyses are costly and may take several days to months. Of the third-generation sequencing techniques, the portable MinION device (Oxford Nanopore Technologies) has received much attention because of its small size and possibility of rapid analysis at reasonable cost. Here, we compare the relative performances of two third-generation sequencing instruments, MinION and Sequel (Pacific Biosciences), in identification and diagnostics of fungal and oomycete pathogens from conifer (Pinaceae) needles and potato (Solanum tuberosum) leaves and tubers. We demonstrate that the Sequel instrument is efficient for metabarcoding of complex samples, whereas MinION is not suited for this purpose due to a high error rate and multiple biases. However, we find that MinION can be utilized for rapid and accurate identification of dominant pathogenic organisms and other associated organisms from plant tissues following both amplicon-based and PCR-free metagenomics approaches. Using the metagenomics approach with shortened DNA extraction and incubation times, we performed the entire MinION workflow, from sample preparation through DNA extraction, sequencing, bioinformatics, and interpretation, in 2.5 h. We advocate the use of MinION for rapid diagnostics of pathogens and potentially other organisms, but care needs to be taken to control or account for multiple potential technical biases. IMPORTANCE Microbial pathogens cause enormous losses to agriculture and forestry, but current combined culturing- and molecular identification-based detection methods are too slow for rapid identification and application of countermeasures. Here, we develop new and rapid protocols for Oxford Nanopore MinION-based third-generation diagnostics of plant pathogens that greatly improve the speed of diagnostics. However, due to high error rate and technical biases in MinION, the Pacific BioSciences Sequel platform is more useful for in-depth amplicon-based biodiversity monitoring (metabarcoding) from complex environmental samples.",
  "references": null
}