{
  "paperId": "6021212cf49b7bbcf99069f13f0d95fe5ab5c720",
  "externalIds": {
    "MAG": "2489829401",
    "DOI": "10.1201/B19336",
    "CorpusId": 114417058
  },
  "url": "https://www.semanticscholar.org/paper/6021212cf49b7bbcf99069f13f0d95fe5ab5c720",
  "title": "Precision Agriculture Technology for Crop Farming",
  "venue": "",
  "year": 2015,
  "citationCount": 107,
  "influentialCitationCount": 4,
  "openAccessPdf": {
    "url": "https://doi.org/10.1201/b19336",
    "status": "HYBRID",
    "license": "CCBYNCND",
    "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1201/B19336?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1201/B19336, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "fieldsOfStudy": [
    "Engineering"
  ],
  "publicationTypes": [
    "Review"
  ],
  "authors": [
    {
      "authorId": "143836361",
      "name": "Q. Zhang"
    }
  ],
  "abstract": "Explores the Sustainable Development of Agriculture in Technology Precision agriculture technology, when properly integrated into the crop production process, can greatly improve overall production and sustainability. Precision Agriculture Technology for Crop Farming focuses on the technology of site-specific crop management; detailing applications for sensing, data handling, modeling, and control. Written by experts who have contributed significantly to the development of precision agriculture technology, this book reviews its historyestablishing background on the various processes and applicationsdescribes the current status, and offers insight into the future technology of precision agriculture. Introducing processes and applications based on a global scale, the book reveals how precision agriculture can be used in large-scale agriculture, community agriculture, and diversified farming. It includes site-specific information from a variety of information sources for planning, planting, growing, and harvesting agricultural crops. It also presents a new concept based on the control system theory that can be used to formulate systematic methods for more effective precision crop production. In addition, this author: Describes yield monitors and guidance systems, GPS-based soil sampling, real-time crop and soil sensors, and remote sensing Evaluates a Japanese model of community-based precision agriculture aimed at high profitability and reliability under regional and environmental constraints Highlights autonomous vehicles, field robots, and other intelligent machinery, emerging developments, and future technology in the field of production agriculture Precision Agriculture Technology for Crop Farming provides an overview of precision agriculture technology development, discusses current and future considerations, and aims to facilitate the successful integration of precision agriculture technology.",
  "references": []
}