{
  "paperId": "6a337b608d319c2b1a34b11a303c05cf076b699e",
  "externalIds": {
    "MAG": "2912590218",
    "DOI": "10.1080/19396368.2019.1560577",
    "CorpusId": 59410263,
    "PubMed": "30696309"
  },
  "url": "https://www.semanticscholar.org/paper/6a337b608d319c2b1a34b11a303c05cf076b699e",
  "title": "Systems Biology in Reproductive Medicine 2019",
  "venue": "Systems Biology in Reproductive Medicine",
  "year": 2019,
  "citationCount": 3,
  "influentialCitationCount": 0,
  "openAccessPdf": {
    "url": "https://www.tandfonline.com/doi/pdf/10.1080/19396368.2019.1560577?needAccess=true",
    "status": "BRONZE",
    "license": null,
    "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'references'}. Paper or abstract available at https://api.unpaywall.org/v2/10.1080/19396368.2019.1560577?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1080/19396368.2019.1560577, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "fieldsOfStudy": [
    "Biology",
    "Medicine"
  ],
  "publicationTypes": [
    "JournalArticle",
    "Review"
  ],
  "authors": [
    {
      "authorId": "2970345",
      "name": "S. Krawetz"
    }
  ],
  "abstract": "Systems Biology in Reproductive Medicine 2019 carries forward the advances observed in 2018 as the pace in our field continues to accelerate. With a rising impact factor along with the number of papers submitted for consideration, we continue to champion a bench to bedside philosophy. The journal emphasizes systems-based research within the framework of Personalized and Precision Reproductive Medicine that is increasingly becoming a part of standard clinical care. It serves to emphasize our interest in providing a well-balanced blend of the male and female reproductive medicine and sciences papers reflective of each contribution to the birth of a healthy child. Animal studies andmodel systems offer insights into what would be considered intractable questions when addressed in the human system. By continuing to cast a wide net, our journal promotes synergy in research covering both clinical and agricultural applications. Our Board continues to grow and reflect the breadth of interests represented in our journal. We are pleased to announce the election of the following five new Board members, each bringing their unique expertise. Dr. George Anifandis – University of Thessaly, Larisa, Greece, embryology and clinical sciences; Dr. Steven Korzeniewski – Wayne State University, Michigan, USA, biostatistics and experimental design; Dr. George Perry – South Dakota State University, South Dakota, USA, whose research spans the entire bovine life-cycle from gamete quality to longevity; Dr. Bhanu Telugu – University of Maryland, Maryland, USA, most noted for his recent work on genome editing in animal models; and Dr. Helen Tempest – Florida International University, Florida, USA, lending her expertise in chromatin structure and its modulation of gene expression. We welcome each of these new members as part of our Editorial Board team. In addition to the above changes to the Board, Dr. Michael Diamond, Augusta University, Georgia, USA, will now be serving as one of our Associate Editors and Dr. René Reijo Pera, Montana State University, Montana, USA, will now serve as an Editorial Board Member. We appreciate their continuing contribution. Dr. David Miller, University of Leeds, Leeds, United Kingdom, is retiring from the Board, and we thank him for his many years serving on the Board, his significant input to its development, and for recommending SBiRM as Systems Biology in Reproductive Medicine’s abbreviation. Dr. Jing Dai is also stepping down and we thank her for initiating a standardized statistical review of submitted manuscripts. We wish both the best of success in their new endeavors. We are also pleased to acknowledge this year’s cover figure for Volume 65 from the laboratory of Associate Editor Dr. Peter Sutovsky, Animal Science and Obstetrics, Gynecology & Women’s Health, University of Missouri, Missouri, USA. The cover feature summarizes the proposed spermatozoal zinc signature as part of the mechanism on a sperm’s path from ejaculate to fertilization. This spans the efflux of zinc (Zn) associated with sperm capacitation and release from oviductal sperm reservoir prior to fertilization. The first issue of our 11th year includes papers that once again emphasize the scope of the journal. This issue begins with a Review Article from our new Board Member Dr. George Anifandis and colleagues titled ‘Artificial oocyte activation: physiological, pathophysiological and ethical aspects’, providing a current state of the art summation. The remaining related papers cover the assessment of risk of a birth defect by Dr. Jing Zhu et al.; examining the levels of interleukin during in vitro fertilization by Dr. Laurice Bou Nemer et al.; cryopreservation by Dr. Munevver Serdarogullari et al.; growth hormone deficiency by Drs. Dragoş Albu and Alice Albu; a quartet of papers from Drs. Oya S. Aydos et al., Grigory A. Demyashkin, Ying Ma et al., and Linjun Chen et al. discussing mechanisms of infertility, sperm diagnostics, and their impact on outcome; papers from Dr. Abdullah Karaer et al. that examines the metabolic analysis of follicular fluid and Dr. Soraya Labied et al. on embryo culture; and closing this issue, the work of Dr. Eduardo H. Umeoka et al. who examine reproductive performance and fetal development. To access the list of the latest articles published online visit Systems Biology in Reproductive Medicine at http://www.tandfonline.com/toc/iaan20/current. I also encourage you to examine the journal’s Editor’s Choice section that began in 2016 and continues to be updated with select newly highlighted papers as they become available at http://explore.tandfonline.com/con tent/med/iaan-editors-choice-2016. The first highlight SYSTEMS BIOLOGY IN REPRODUCTIVE MEDICINE 2019, VOL. 65, NO. 1, 1–2 https://doi.org/10.1080/19396368.2019.1560577",
  "references": null
}