{
  "paperId": "6e4753697b128f0ed20cff94d2ef6a0e850762c0",
  "externalIds": {
    "MAG": "3033399519",
    "DOI": "10.29150/2237-2202.2021.248376",
    "CorpusId": 230933136
  },
  "url": "https://www.semanticscholar.org/paper/6e4753697b128f0ed20cff94d2ef6a0e850762c0",
  "title": "Análise de falhas no cultivo da cana de açúcar a partir de imagens de Aeronave Remotamente Pilotada",
  "venue": "Journal of Hyperspectral Remote Sensing",
  "year": 2018,
  "citationCount": 0,
  "influentialCitationCount": 0,
  "openAccessPdf": {
    "url": "https://periodicos.ufpe.br/revistas/jhrs/article/download/248376/40202",
    "status": "GOLD",
    "license": "CCBY",
    "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.29150/2237-2202.2021.248376?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.29150/2237-2202.2021.248376, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "fieldsOfStudy": [
    "Environmental Science"
  ],
  "publicationTypes": [
    "Review"
  ],
  "authors": [
    {
      "authorId": "1491595534",
      "name": "José Érico do Nascimento Barros"
    }
  ],
  "abstract": "Precision Agriculture aims at the detailed management of the agricultural production system. High resolution orbital sensors have limitations such as temporal resolution and cloud cover. The RPA (Remotely Piloted Aircraft) appears as an option to assist in Precision Agriculture, since the acquisition of the images can be decided according to the need of the study of the planting and, therefore, no longer having the limitation of the temporal resolution of imaging. In addition, the cloud cover problem is no longer a problem as there is the advantage of being able to plan the flight to a lower altitude than the clouds present in the area. This study shows how the obtaining of the products of a cartographic base, produced from an aerial survey of a Remotely Piloted Aircraft, makes it possible to detect failures in sugarcane cultivation from orthomosaic generated by three - dimensional processing. The collection of information on the geographic distribution gives us support for the development of this work, aiming to subsidize the management of private resources in agriculture, enabling the improvement of productivity.",
  "references": []
}