{
  "paperId": "836de52cda0e542defa62c8b4d27617d0b6244a6",
  "externalIds": {
    "MAG": "2606646047",
    "DOI": "10.7146/kuml.v64i64.24218",
    "CorpusId": 185238890
  },
  "url": "https://www.semanticscholar.org/paper/836de52cda0e542defa62c8b4d27617d0b6244a6",
  "title": "Genfundne gravhøje i Nordjylland – Kartografiske studier",
  "venue": "Kuml",
  "year": 2015,
  "citationCount": 1,
  "influentialCitationCount": 0,
  "openAccessPdf": {
    "url": "https://doi.org/10.7146/kuml.v64i64.24218",
    "status": "BRONZE",
    "license": null,
    "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'references'}. Paper or abstract available at https://api.unpaywall.org/v2/10.7146/kuml.v64i64.24218?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.7146/kuml.v64i64.24218, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "fieldsOfStudy": null,
  "publicationTypes": [
    "Review"
  ],
  "authors": [
    {
      "authorId": "105007360",
      "name": "Niels Haue"
    }
  ],
  "abstract": "Rediscovered burial mounds in northern Jutland – a cartographical surveyIn 2005-07, archaeologists from the Historical Museum of Northern Jutland carried out an inspection of those burial mounds still visible and protected (scheduled) under Danish cultural heritage legislation. Scheduled burial mounds were the main focus, but new – or rather forgotten – mounds were also observed in the forests (fig. 1). These observations prompted a preliminary study of a small area, which revealed that a large number of burial mounds, hitherto unrecorded in the national archaeological database, Sites and Monuments – Fund og Fortidsminder, are marked on historical maps. This was especially true of the first cadastral maps, known as Original 1 maps, on which a large number of these monuments are marked. But the first edition topographical maps, known as Høje Målebordsblade, also show mounds that are not included in the national database. A major study was initiated in 2008 and the mounds marked on the earliest cadastral maps were recorded, leading to an increase of 33 % in the numbers mapped. This article is a source-critical examination of the use of these maps.The survey area corresponded to the archaeological area of responsibility of the Historical Museum of Northern Jutland and comprises 8% of the total land area of modern Denmark. Information on land-use in historical times can be obtained from the Danish Royal Academy of Sciences and Letters’ manuscript maps, i.e. Videnskabernes Selskabs konceptkort, which date back to the late 18th century. The survey area covered both coastal and inland regions and a great variety of vegetation types could be observed – including marshland, heathland and sand dunes (fig. 2).In the late 18th century, several agricultural reforms were initiated, leading to substantial changes in the cultural landscape. New fields were established and the implementation of the statutory instrument on road regulation of 1793 led to stones being robbed from nearby dolmens and burial mounds. This devastation of ancient burial monuments prompted the establishment of the Royal Commission for the Preservation of Antiquities, Oldsagskommissionen, in 1807, and shortly afterwards a total of 187 mounds and dolmens across the country became protected by law. To stem the continuing destruction, the chief curator of the Danish National Museum, J.J.A. Worsaae, launched systematic surveys of prehistoric monuments throughout the country in 1873. For many years, funding for these so-called “district surveys”, herredsberejsninger, was allocated in the Danish state budget. The surveys only came to an end in 1930, when all the ancient monuments in the country were considered to have been recorded. Most of the monuments in the northern parts of Jutland were recorded during the final decades of the 19th century (fig. 3). The surveys had two main aims: Firstly, to record all ancient monuments and sites still visible, as well as the locations of lost monuments still known to local communities; secondly, to locate the best preserved and most interesting monuments and persuade the landowners to protect these. The district surveys were carried out by the National Museum, and each parish was visited by an antiquarian and an illustrator. Due to the pressure of time, only one or two days were allocated to each of the smaller parishes and, given the contemporary infrastructure and modes of transport, it must be assumed that not all mounds were recorded. The burial mounds were marked on a map but, in a time before GPS, the location of many of them is far from precise. In 1937, a new act for the protection of ancient monuments was passed. The key issue in this legislation was that all visible monuments were now automatically protected by the law. Whether a monument was visible or not was to be decided by the Danish National Museum. In order to do this, all the monuments recorded in the district surveys had to be revisited. This took 20 years and resulted in a grand total of 23,774 monuments and sites across Denmark that were to be protected against future destruction.After some adjustments over the last 80 years, the ancient monuments database now lists a total of 6822 burial mounds in the survey area, of which 2970 are listed as protected monuments. The Sites and Monuments database thereby contains the accumulated records from archaeological surveys carried out over the last 200 years. The burial mounds could be listed under three categories: recorded mounds, unknown mounds and rediscovered mounds, obtained from the maps used in this survey (fig. 4).The first edition topographical maps published in 1842-99, the Høje Målebordsblade, are at a scale of 1:20.000 and the details available from these are both numerous and precise. The maps give a clear picture of the elevation of the terrain and the types of vegetation within a given area (heathland, marshland etc.). They also include most of those burial mounds still visible and thereby provide a detailed source of information on the number of monuments extant in the late 19th century. The accuracy of the mapping of mounds has been evaluated in recent times by way of GPS and shows remarkable precision. Traditional surveying techniques gave positions differing by only a few metres from those determined by modern methods. Approximately 75% of the known preserved mounds were marked on the maps (fig. 5). The mapping was contemporary with the Danish National Museum’s district surveys, but only limited degree of coherence can be observed between the two data sets. This inconsistency can largely be explained by two factors: The archaeologists’ survey was restricted to a few days in each parish and the National Museum wanted to obtain information about monuments no longer discernible in the landscape. In the present study, detailed investigation of the topographical maps yielded a total of 4166 burial mounds. Of these, 326 are not recorded in the Sites and Monuments database and should therefore be regarded as rediscovered mounds. In many cases, the maps contain additional information on the locations of other burial mounds, but these could be anomalies in the terrain contours (fig. 6).Large parts of Denmark were surveyed and mapped following the agricultural reforms of the late 18th century. This resulted in the first cadastral maps, the Original 1 maps, which were drawn at a scale of 1:4000 and therefore contain a great number of details, including much useful information for archaeologists: place names, soil quality, burial mounds etc. (figs. 7 and 8). Each map covers one cadastral district (ejerlav), and the total survey area comprises 608 of these districts. Unfortunately, the mapping was not standardised and not every surveyor used the symbols for burial mounds. Of the 2975 monuments still visible today, only 53% were included on the cadastral district maps, even though these monuments must have been visible 200 years ago (fig. 9). This discrepancy can largely be explained by the lack of standardisation in the mapping, and in some cases the surveyors simply mapped small squares of non-arable area within the arable land (fig. 10). In the present study, only mounds marked with a specific signature were included. Attention should also be drawn to another possible source of bias when working with these maps: They are not static. They were in use for several decades and changes in land ownership, parish borders, field taxation etc. were added to them. Each map therefore contains several layers, each of which represents a historical event. A comparison of the two series of historical maps, the mounds recorded in the Sites and Monuments database and the true position of the scheduled mounds, reveals some variation (fig. 11). With a few exceptions, the positions of the mounds are marked on the cadastral maps with remarkable precision (fig. 12). The present review yielded the location of 4875 burial mounds, 1785 of which were unknown – or rather had been forgotten – prior to this study, i.e. a 26% increase relative to the data in Sites and Monuments. The mound signatures absent from many of the maps indicate that the number of mounds must be considered an absolute minimum.The Venn diagram (fig. 14) shows that 2320 mounds are marked on both historical maps and included in the Sites and Monuments database, while 1689 mounds are only marked on the cadastral maps. The rediscovered mounds and known mounds are not evenly distributed relative to the land-use indicated on the Royal Academy of Sciences and Letters’ manuscript maps (fig. 15). These maps date from the late 18th century and show that more than half of the dry-land areas were used for agricultural purposes, while approximately one third was covered with heath. According to the historical maps, the majority of the known mounds in the Sites and Monuments database are situated on heathland, while only 30.6% are evident in agricultural areas. The rediscovered mounds are spread evenly across agricultural land and heath. If we turn our attention to the total number of burial mounds, heath areas are still over-represented. The differences between the percentages of land-use and the percentages of known burial mounds have come closer to equalisation with this study. This shows that mounds located near the farms would be at greater threat than those located on the outer margin of the fields. This is illustrated by the distance from the burial mounds to the boundary of the nearest settlement (fig. 16). According to figure 18, the lack of mounds in old agricultural areas results from a combination of land-use and the distance to historical farmsteads. A large proportion of the rediscovered mounds were positioned in the fields around old villages and they had been destroyed prior to the district surveys of the late 19th century. All the sources reveal a low occurrence of mounds in historical forests. This can be explained to some degree by the ancient forest ",
  "references": null
}