{
  "paperId": "8c42b6a7048cab05f9aeaa47c2d88d576e2fb5a8",
  "externalIds": {
    "MAG": "2942099721",
    "DOI": "10.9734/AJAEES/2019/V32I230151",
    "CorpusId": 187631952
  },
  "url": "https://www.semanticscholar.org/paper/8c42b6a7048cab05f9aeaa47c2d88d576e2fb5a8",
  "title": "Role Play as an Innovative Teaching Technique: Attitude of Agri Students",
  "venue": "Asian Journal of Agricultural Extension Economics & Sociology",
  "year": 2019,
  "citationCount": 0,
  "influentialCitationCount": 0,
  "openAccessPdf": {
    "url": "http://www.journalajaees.com/index.php/AJAEES/article/download/30151/56567",
    "status": "BRONZE",
    "license": null,
    "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'references'}. Paper or abstract available at https://api.unpaywall.org/v2/10.9734/AJAEES/2019/V32I230151?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.9734/AJAEES/2019/V32I230151, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "fieldsOfStudy": [
    "Psychology"
  ],
  "publicationTypes": [
    "Review"
  ],
  "authors": [
    {
      "authorId": "123831382",
      "name": "P. Anbarasan"
    }
  ],
  "abstract": "The objective of this study is to assess student’s attitude towards role-playing in agricultural sciences. For the purpose, an initiative was taken to develop an attitude scale using Likert’s summated rating method. Twenty one (21) statements were selected by consulting the specialists and by reviewing literature and were given to the non-sample students of B.Sc. Agriculture who were exposed to the role-playing technique. Using Likert’s Summation formula, the t- value of each statement was analyzed. From the t- value, 8 statements were retained for the final scale. The reliability and validity of the scale indicate its precision and consistency of the results. This scale is the first of its kind and can be used in future to measure the attitude of the students of various disciplines towards role-playing with suitable modifications.",
  "references": null
}