{
  "paperId": "93e9611ac5575cb2753459899470b09d3ae221f3",
  "externalIds": {
    "MAG": "2809565734",
    "DOI": "10.1111/AEC.12625",
    "CorpusId": 250585088
  },
  "url": "https://www.semanticscholar.org/paper/93e9611ac5575cb2753459899470b09d3ae221f3",
  "title": "Small mammal responses to farming practices in central Argentinian agroecosystems: The use of hierarchical occupancy models",
  "venue": "Austral ecology (Print)",
  "year": 2018,
  "citationCount": 6,
  "influentialCitationCount": 0,
  "openAccessPdf": {
    "url": "",
    "status": "CLOSED",
    "license": null,
    "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'references'}. Paper or abstract available at https://api.unpaywall.org/v2/10.1111/AEC.12625?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1111/AEC.12625, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "fieldsOfStudy": [
    "Geography"
  ],
  "publicationTypes": [
    "Review"
  ],
  "authors": [
    {
      "authorId": "145802803",
      "name": "M. D. Gomez"
    },
    {
      "authorId": "6425479",
      "name": "A. Goijman"
    },
    {
      "authorId": "6392236",
      "name": "J. Coda"
    },
    {
      "authorId": "88838374",
      "name": "V. Serafini"
    },
    {
      "authorId": "86916684",
      "name": "J. Priotto"
    }
  ],
  "abstract": "Organic farming is more environmentally friendly than conventional agriculture, promoting greater levels of habitat heterogeneity. Field borders could be more suitable for biodiversity in agricultural anthromes. Small mammals are crucial in these anthromes due to their contribution to food webs and seed consumption. We used hierarchical multi-season occupancy models to assess the effect of organic versus conventional farming on multiple small mammal species in agricultural anthromes of central Argentina. We modelled detectability and increased precision of estimates, overcoming deficiencies of previous studies. Small mammals were seasonally surveyed in 70 field borders (conventional) and 63 (organic) during two years. We were able to include less frequent specialist species, detecting a positive relationship with organic management possibly because of higher habitat quality of borders. Vegetation volume was the most important explanatory variable in both managements. Species’ richness was greater under organic management mainly in spring when the habitat quality differences with conventional management were the greatest. Spring is key for the rodent assemblage because of the beginning of reproductive period, when resource demand is important. We suggest that maintaining high quality border habitats, as those supported by organic management, could allow farmers to obtain economic profit while also contributing to biodiversity conservation. Considering the positive role that native rodents may have in some agricultural anthromes, the maintenance of high population numbers may be important for biodiversity conservation. The approach used in this study shows the importance of modelling imperfect detection, reducing bias in parameter estimates, and it should be implemented in similar studies. Land use conversion to agriculture and pasturelands may alter not only the abundance of seed-eating animals but also their role as seed predators and dispersers. We investigated the effect of landscape changes, including areas under restoration process, on seed predation by native rodents in the Brazilian Cerrado, the most diverse savanna of the world. We evaluated seed predation of two tree species ( Tachigali vulgaris and Copaifera langsdorffii ; Fabaceae ) in five habitats: typical savanna (cerrado sensu stricto), abandoned pasture dominated by African grass Urochloa decumbens , and three environments representing distinct phases along an active restoration process (two, three, and four years after direct seeding of native species). We also evaluated rodent abundance in these areas. In captivity, we offered seeds of both species and of Urochloa decumbens to Necromys lasiurus ( Sigmodontinae ), the most abundant rodent in the study. Field tests with semipermeable exclosures indicated that small rodents were the main seed predators in all habitats. Only for Copaifera langsdorffii seed-predation rates differed among habitats, being higher during the rainy season in the native Cerrado and pasture. We captured 180 rodents belonging to five species, with a high dominance of Necromys lasiurus (ca. 95% of all individuals). Areas in more advanced regeneration process and native environments tended to show greater rodent richness, following plant community patterns. In captivity, Necromys lasiurus preyed upon all species offered. Our results suggest that the transformation of native areas in planted pastures and subsequent regeneration processes modify the abundance of small mammals in the Brazilian savanna but not their role as main seed predators. The abundance of this group is relevant for crucial ecological processes, such as seed predation Seed-rodent interaction has been recognized as one of the important components of the forest ecosystems. Seeds provide food to rodents which provide service of seed dispersal and regeneration. It is obvious that seed-rodent relation if composed of both predation and mutualism. Seeds tend to manipulate hoarding behavior of rodents to maximize the seed dispersal fitness by adopting a series of conflicting but well-balanced strategies of attraction and defense. Rodents tend to select seeds to maximize their fitness by adopting various hoarding behavior and seed management strategies. This reciprocal interaction would finally determine their ecological relationship shifting between predation to mutualism, and then the role of rodents in forest regeneration. Deforestation and forest fragmentation would greatly affect the seed-rodent interactions and then forest regeneration and health. There is a need to take actions of managing the seed-rodent interaction so as to facilitate recovery of degenerated forest ecosystems. Since middle 1990s, the seed-rodent interaction in six locations representing the tropical, sub-tropical, warm-temperate, temperate and cold-temperate climate zones have been carried out in China. This paper will present a review of research progresses on seed-rodent interactions in China. Rodents influence plant establishment and regeneration by functioning as both seed predators and dispersers. However, these rodent-plant interactions can vary significantly due to various environmental conditions and the activity of other insect seed-predators. Here, we use a combination of both field and enclosure (i.e, individual cage and semi-natural enclosure) experiments, to determine whether rodents can distinguish sound seeds from those infested with insects. We also demonstrate how such responses to insects are influenced by food abundance and other environmental factors. We presented rodents with two kinds of Quercus aliena seeds (sound and insect-infested seeds) in a subtropical forest in Qinling Mountains, central China, from September to November of 2011 to 2013. The result showed that rodents prefer to hoarded and ate sound seeds than infested seeds in the field and semi-natural enclosure, while they prefer to ate infested seeds than sound seeds in the individual cages. In addition, both hoarding and eating decisions were influenced by relative food abundance. Rodents hoarded more sound seeds in years of high food abundance while they ate more both sound and insect-infested seeds when food was less abundant. Compared with field results, rodents reduced scatter hoarding behavior in semi-natural enclosures and ate more insect-infested seeds in smaller individual cages. These results further confirm that rodents distinguish infested seeds form non-infested seeds but demonstrate that this behavior varies with conditions (environment and food abundance). We suggest that such interactions will influence the dispersal and natural regeneration of seeds as well as predation rates on insect larvae. Seed hoarding behaviour of rodents plays an important role in seed dispersal and seedling regeneration of trees, as well as for the evolution of mutualism between trees and rodents in forest ecosystems. There are two opposite views on why rodents adopt a scatter-hoarding strategy: the pilferage avoidance hypothesis predicts that the cache pilferage rate should be very low to ensure benefits of cache owners, while the reciprocal pilferage hypothesis has an opposite prediction. Because it is difficult to identify seed hoarders and pilferers under field conditions by using traditional methods, the full costs incurred and benefits accrued by scatter-hoarding have not been fully evaluated in most seed-rodent systems. Our study aimed to test the two hypotheses at individual level under field conditions. By using infrared camera tracking and seed tagging methods, we investigated the comprehensive benefits and losses of scatter-hoarded Camellia oleifera seeds for three sympatric rodent species ( Apodemus draco , Niviventer confucianus and Leopoldamys edwardsi ) in a subtropical forest of Southwest China 2013-2015. We established the relationships between the rodents and the seeds at the individual level. For each rodent species, we calculated the cache recovery rate of cache owners, as well as conspecific and interspecific pilferage rates. We found all three sympatric rodent species had a cache recovery advantage (recovery rates > 50%) with rates that far exceeded average pilferage rates (<10%) over a 30-day tracking period. The smallest species ( Apodemus draco ) showed the highest rate of scatter-hoarding and the highest recovery advantage compared to the other two larger species. Across species, rates of scatter-hoarding and benefits were positively correlated with each other. Hence species having higher scatter-hoarding preference had higher competitive ability for seeds. Our results suggest that scatter-hoarding benefits the cache owners more in food competition, not the cache pilfers, supporting the pilferage avoidance hypothesis. Seed predation and dispersal by scatter-hoarding rodents play an important role not only on the seedling regeneration of trees, but also on the spatial distribution and structure composition of the whole forest communities. Both seed size and seed density have been found significantly affect the foraging preferences of rodents, which in turn influence the seed fates themselves. Current studies focusing on how seed size and seed density affect foraging behaviour of scatter-hoarding rodents mainly target one of two scales of comparison: the species scale, with comparisons of dispersal and predation of seeds from multiple species; or the individual seed scale, with comparisons among individual seeds from the same species. Even though individual variation in reproductive success within populations is a key component of evolutionary fitness, variation in seed dispersal and predation at the scale of individual trees is poorly understood. Our study asks how variation in seed mass and number among tree individuals affects the behaviour of animal dispersers and in turn the fitness of the trees. We first surveyed intraspecific variation in seed production of two Fagaceae tree species in",
  "references": null
}