{
  "paperId": "9aeceed46c85cf2b28a0e2273186f0718686b155",
  "externalIds": {
    "MAG": "2972382513",
    "DOI": "10.7326/M18-2800",
    "CorpusId": 202406242,
    "PubMed": "31499522"
  },
  "url": "https://www.semanticscholar.org/paper/9aeceed46c85cf2b28a0e2273186f0718686b155",
  "title": "Local Area Variation in Morbidity Among Low-Income, Older Adults in the United States",
  "venue": "Annals of Internal Medicine",
  "year": 2019,
  "citationCount": 5,
  "influentialCitationCount": 0,
  "openAccessPdf": {
    "url": "https://europepmc.org/articles/pmc7062581?pdf=render",
    "status": "GREEN",
    "license": null,
    "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'references'}. Paper or abstract available at https://api.unpaywall.org/v2/10.7326/M18-2800?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.7326/M18-2800, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "fieldsOfStudy": [
    "Medicine"
  ],
  "publicationTypes": [
    "JournalArticle",
    "Review"
  ],
  "authors": [
    {
      "authorId": "4378752",
      "name": "M. Polyakova"
    },
    {
      "authorId": "48602541",
      "name": "Lynn M. Hua"
    }
  ],
  "abstract": "Supplement. Supplemental Material Geographic variation in mortality and morbidity and the association between socioeconomic status and health are both widely recognized (111). Researchers have found that there are substantial differences in life expectancy and in causes of death across U.S. geographic regions, even after accounting for differences in age, sex, and racial composition (1224). A separate, large literature has reported differences in mortality and morbidity between different socioeconomic and demographic groups in the United States (13, 16, 22, 2538). More recently, substantial differences in the income-longevity association were found across geographic locations (39, 40). Researchers have documented that adults with incomes in the first quartile of the income distribution living in more affluent areas of the United States have higher life expectancies (39). To our knowledge, limited evidence exists on the local area variation in morbidity stratified by income using clinical measures of diagnoses and large samples of the U.S. population. Using 100% of Medicare administrative records, we aimed to assess the association between the prevalence of chronic conditions among low-income, older adults and the economic affluence of local areas in the United States. We used receipt of the low-income subsidy in the Medicare Part D pharmaceutical benefit as a measure of low income. We hypothesized that low-income, older adults living in more affluent areas of the country are healthier and that areas with poor health in the low-income, older adult population tend to have a high prevalence of most chronic conditions. Methods We conducted a cross-sectional association analysis using 100% of administrative Medicare records for 2015. The Institutional Review Board of the National Bureau of Economic Research approved this study. A total of 6.4 million older adults with a history of low-income support under the Medicare Part D prescription drug benefit for at least 1 month between 2006 and 2015 were included in the study. The Medicare Part D program, which enrolls more than 70% of all Medicare beneficiaries in the United States, provides cost sharing and premium subsidies for beneficiaries who have incomes less than 150% of the federal poverty line and modest countable assets (41, 42). More than 85% of low-income subsidy recipients are automatically enrolled into the program by the Centers for Medicare & Medicaid Services (CMS) (43). Data Sources Medicare administrative data for 2006 to 2015 were obtained from CMS. For the 58.3 million persons enrolled in Medicare in 2015, the Medicare Master Beneficiary Summary File (MBSF) provided information about age, sex, race, Social Security Administration (SSA) county code, Medicare Part D enrollment status, receipt of low-income support under Part D, and time of first diagnosis for 57 chronic conditions tracked by CMS. From the 2006 to 2014 MBSF, for each person in the data, we obtained the history of whether they received Part D low-income subsidies. The CMS and the Health Inequality Project (https://healthinequality.org/) provided the mapping of SSA county codes to Federal Information Processing Standards codes and in turn to commuting zone (CZ) codes, as well as information on median house prices in each CZ and whether each CZ intersected a metropolitan statistical area. Sample Persons were excluded from the study if they lived outside the United States, qualified for Medicare for reasons other than old age, or were younger than 66 years or older than 100 years in 2015. We further excluded beneficiaries without Part D enrollment because we were unable to identify low-income status. Finally, we excluded persons who did not receive any low-income subsidy under Part D during a period of 120 months from 2006 to 2015. Local Area and Affluence A local area was defined as a CZ, which is a group of counties. This grouping, developed by the U.S. Department of Agriculture, reflects commuting patterns between home and work in a local area. We chose this level of geographic aggregation because it reflects local economic and social activity ties rather than political boundaries. We used the 1990 CZ delineation, which split the United States into 741 CZs. Our analytic sample did not include 5 CZs in Alaska, restricting our analysis to 736 CZs. Affluence was measured using the median home value in the CZ. House prices incorporate both market and nonmarket (for example, air quality) characteristics of a local area and are an effective summary measure of an area's socioeconomic status (44). We ordered 736 CZs by increasing median house value and divided them into 10 equally sized groups, representing deciles of the median home value distribution. Within each group, we categorized CZs into urban and rural. A CZ was defined as urban if it intersected a metropolitan statistical area. Outcomes A person was recorded to have a chronic condition if the date when they first met CMS diagnosis criteria for this condition was indicated. The CMS diagnosis criteria are based on a combination of diagnostic and procedural codes. Indicators for 57 chronic conditions tracked by CMS were available. We excluded 9 conditions with prevalences less than 0.5 per 100 persons to ensure enough observations for each condition in each CZ. Demographic Variables To ensure sufficient sample size within each demographic cell, we discretized age into the following 5 disjoint intervals: aged 66 to 69, 70 to 74, 75 to 79, 80 to 84, and 85 or older. We created indicator variables for being female and white using sex and race records. Statistical Analysis Descriptive data for the whole sample are presented as counts, means, and SDs. Crude prevalence per 100 persons was computed for all 48 conditions in the full sample. Crude CZ-level prevalence was adjusted to account for differences in age, race, and sex across CZs. The adjustment was done using direct standardization (45). Twenty demographic cells were defined for standardization, using all combinations of indicators for 5 age intervals, female, and white. This adjustment method allowed for the relationship between prevalence and age to be CZ-specific and to vary flexibly by age and sex. The standard population distribution was computed empirically from the entire analytic sample. We used factor analysis to assess the spatial covariation of condition prevalences and to aggregate 48 conditions into a composite CZ-level prevalence index. The share of variance explained by the first factor in the factor analysis was used as a measure of covariation across condition prevalences. The composite index was constructed in 2 steps. First, we computed a regression-based score for the first factor in our analysis (46, 47). This score is an optimally weighted linear combination of Z scores of condition prevalences in each CZ. Second, to improve interpretability, we rescaled the standardized CZ-level factor score to be an index with a mean of 100 and an SD of 10. The resulting local area chronic condition index (LACCI) for low-income, older adults can be interpreted in terms of percentage. For example, an LACCI of 150 would suggest that the CZ has a 50% higher composite prevalence of 48 examined conditions relative to an average CZ. In addition to factor analysis, we used a graphical approach to illustrate the extent of spatial covariation of condition prevalence. We first identified the 100 most populous CZs and ordered them by increasing LACCI. We then created a matrix that, for each CZ in rows, recorded the adjusted prevalence of each condition in columns. We used a color scale from blue (low) to red (high) to code relatively higher prevalence of a condition across CZs. If the prevalence of all conditions was correlated within a CZ, we would expect that, for CZs with the lowest LACCI, the prevalence of most conditions should be relatively low and hence the share of blue cells should be high; conversely, for CZs with the highest LACCI, the prevalence of most conditions should be relatively high and thus so should the share of red cells. Finally, we examined the association between LACCI and the deciles of the median home price distribution across CZs. We quantified the magnitude of the association by computing the mean LACCI within each decile separately for urban and rural CZs. We measured the precision of the association using a 2-sided t test that compared the mean LACCI in deciles 1 to 9 with the mean LACCI in decile 10, which had the highest median home values. A P value less than 0.050 was considered statistically significant. We performed several sensitivity analyses. First, we repeated the analysis using multivariable logistic regression for demographic adjustment. Demographic adjusters were included as main effects for 5 age groups and as indicators for being female and white. We included separate indicators for women in each age group and for white women, which allowed age effects to vary by sex and for the sex effect to vary by race. Standard errors were clustered at the CZ level to account for the hierarchical structure of the data. The logistic regression included indicator variables for each CZ. Adjusted prevalence was predicted for each CZ at the mean of demographic groups in the full sample. Second, we repeated the analysis using direct standardization, adjusting for age and sex but not race. Third, we repeated the analyses on a subsample of persons who were reported to live in the same CZ between 2006 and 2015, thus restricting our analysis to those who did not move in the 10 years before our measurement. Fourth, we examined methods other than factor scores for aggregating 48 conditions into an LACCI, such as a linear combination of condition prevalence that uses national prevalence as weights, or a linear combination of standardized condition prevalence with equal weights. All analyses were performed using Stata for Unix 15.1/MP (StataCorp). Role of the Funding Sour",
  "references": null
}