{
  "paperId": "b1141324cbb4acb4fed70d78b188430b43c76980",
  "externalIds": {
    "DOI": "10.12692/ijb/15.3.505-513",
    "CorpusId": 284386850
  },
  "url": "https://www.semanticscholar.org/paper/b1141324cbb4acb4fed70d78b188430b43c76980",
  "title": "Prospects and scope of precision engineering, protected agriculture and vertical farming in Pakistan- A review",
  "venue": "International Journal of Biosciences",
  "year": 2019,
  "citationCount": 0,
  "influentialCitationCount": 0,
  "openAccessPdf": {
    "url": "",
    "status": null,
    "license": null,
    "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'references'}. Paper or abstract available at https://api.unpaywall.org/v2/10.12692/ijb/15.3.505-513?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.12692/ijb/15.3.505-513, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "fieldsOfStudy": null,
  "publicationTypes": [
    "JournalArticle",
    "Review"
  ],
  "authors": [],
  "abstract": "Precision agriculture is designed to improve agricultural production system through generating and converging multiple information based systems to boost income and reduce environmental hazards. These techniques have shown advantages for farmers as well as reduced environmental pressures in advanced world. This article offers overview of agricultural accuracy and observes potential, opportunities, consequences, problems and significance of agricultural precision apps in Pakistan’s agricultural system. Farmer and government establishments should look forward to implementing fresh and supportable technologies in this view to improve effectiveness of accessible resources and decrease involvement expenses. Before this, it is necessary to realize the efficiency of precision techniques in Pakistan through field studies and procedures in land management. Before this, it is necessary to realize the efficiency of precision techniques in Pakistan. Precision farming (PA) idea was launched as a mixture of positioning system technology, adaptable rate technology, remote sensing, yield mapping, etc. for site-specific crop management to enhance productivity, Sustainability with decreased environmental impact. Recent study has concentrated considerably on different characteristics of protective structures for protected agriculture. For vertical farming, study has often identified technological differences depending on outdoor / indoor structures, ways to enhance the access of crops to light (natural or artificial), increasing media and nutrient/ water supply, sophisticated structures such as generating electricity and integrating manufacturing room into an office / residential room, and water treatment.",
  "references": null
}