{
  "paperId": "b2555bdc5bc0a4fa3e61796b22f777f980938fc8",
  "externalIds": {
    "DOI": "10.37157/fimca.v5i2.55",
    "CorpusId": 265169709
  },
  "url": "https://www.semanticscholar.org/paper/b2555bdc5bc0a4fa3e61796b22f777f980938fc8",
  "title": "Desempenho Germinativo E Vigor Inicial De Plântulas De Cultivares De Glycine Max Em Diferentes Substratos",
  "venue": "REVISTA FIMCA",
  "year": 2018,
  "citationCount": 0,
  "influentialCitationCount": 0,
  "openAccessPdf": {
    "url": "",
    "status": "CLOSED",
    "license": null,
    "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'references'}. Paper or abstract available at https://api.unpaywall.org/v2/10.37157/fimca.v5i2.55?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.37157/fimca.v5i2.55, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "fieldsOfStudy": null,
  "publicationTypes": [
    "JournalArticle"
  ],
  "authors": [
    {
      "authorId": "113240128",
      "name": "A. Machado"
    },
    {
      "authorId": "2070255886",
      "name": "Rodrigo da Silva Ribeiro"
    },
    {
      "authorId": "134438569",
      "name": "M. S. Moraes"
    },
    {
      "authorId": "2266541789",
      "name": "Higor Marcelo Rainho"
    },
    {
      "authorId": "2266541188",
      "name": "Paulo Vitor da Silva Ravani"
    },
    {
      "authorId": "46596884",
      "name": "V. M. Spinelli"
    }
  ],
  "abstract": "Introdução: Dentre as áreas destinadas à agricultura no Brasil, destaca-se a extensa área com cultivo de soja, que alcançou aproximadamente 34 mil hectares na safra 2016/17. Inicialmente o cultivo de soja tinha maior expressão na região sul do país, difundiu-se para região centro oeste que se tornou o celeiro nacional de grandes culturas, e mais recentemente rompeu fronteiras agrícolas alcançando expressiva área em cultivo na Amazônia legal. Objetivos: O objetivo do trabalho foi avaliar o potencial germinativo e vigor inicial de duas cultivares de soja (Glycine max), obtido a partir do teste de germinação, de acordo com as normas da RAS (Regra Análise de Sementes). Materiais e Métodos: Foi conduzido no Laboratório de Bromatologia da FIMCA, um experimento, com duas cultivares de soja, BRS7680RR e BRS7780IPRO, disponibilizadas pela EMBRAPA-RO. As sementes foram semeadas em bandejas, com os seguintes substratos: solo + areia lavada média (2:1) e em rolos papel (testemunha). Posteriormente, a bandeja foi acondicionada em condições de viveiro e a testemunha foi mantida em condições de laboratório (temperatura de 25 ± 0,5ºC). O substrato e o rolo de papel foram umedecidos, visando manter a umidade entre 85-90%, onde permanecerampor 7 dias; sendo a primeira contagemrealizada no 4º dia e a última no 7º dia após a semeadura. O delineamento experimental utilizado foi o inteiramente casualizado, em esquema fatorial 2 x 2, com quatro repetições. Cada repetição foi composta por 50 sementes, totalizando 200 sementes por tratamento. A altura dos seedlings e comprimento de raiz foram registrados após o sétimo dia após a semeadura (DAS), com o auxílio de régua milimetrada. Para a obtenção da massa fresca e seca total foram coletadas 10 seedlings que foram pesadas em balança de precisão, e posteriormente acondicionados em saco de papel, permanecendo em estufa de secagem, com circulação de ar forçada, por 72 horas a 60°C. Depois de secas, as amostras foram novamente pesadas para determinação da massa seca total (MST). Resultados: Foram encontradas diferenças significativas para a característica analisada, de acordo com o teste F, a 1% de probabilidade. A cultivar  BRS7680RR expressou maior vigor germinativo (98%) e maior biomassa seca total em relação a cultivar BRS7780 IPRO. Conclusão: Os substratos rolo de papel e solo mais areia lavada constitui uma alternativa viável para a germinação de sementes de soja.\nABSTRACTIntroduction: Among the areas devoted to agriculture in Brazil, the area stands out with soybean cultivation, which reached approximately 34 thousand hectares in the 2016/17 harvest. Initially, soybean cultivation was more pronounced in the southern region of the country, it spread to the center-west region that became the national granary of large crops, and more recently broke agricultural frontiers reaching a significant area under cultivation in the legal Amazon. Objectives: The objective of this work was to evaluate the germination potential and initial vigor of two soybean cultivars (Glycine max) obtained from the germination test according to the SAR (Seed Analysis Rule) standards. Materials and Methods: For this, an experiment was conducted at the FIMCA Bromatology Laboratory,with two soybean cultivars, BRS7680RR and BRS7780IPRO, available from EMBRAPA-RO. The seeds were seeded in trays with the following substrates: soil + medium washed sand (2: 1) and paper rolls (control). Subsequently, the tray was conditioned under nurseryconditions, and the control was maintained under laboratory conditions (temperature of 25 ± 0.5 ºC). The substrate and the roll of paper were moistened, aiming to maintain humidity between 85-90%, where they remained for seven days; being the first count performed onthe 4th day and the last on the 7th day after sowing. The experimental design was completely randomized, in a 2 x 2 factorial scheme, with four replications. Each replicate was composed of 50 seeds, totaling 200 seeds per treatment. The height of the seedlings and root length were recorded after the seventh day after sowing (DAS), with the aid of a millimeter ruler. To obtain the total fresh and dry mass, 10 seedlings were collected and weighed on a precision scale, and then packed in a paper bag and dried in a drying oven with forced air circulation for 72 hours at 60 ° C. After drying, the samples were again weighed for determination of the total dry mass (MST). . Results: Significant differences were found for the analyzed characteristic, according to the F test, at 1% probability. The cultivar BRS7680RR expressed higher germinative vigor (98%) and higher total dry biomass in relation to cultivar BRS7780 IPRO. Conclusion: The paper roll and soil plus washed sand substrates are a viable alternative for the germination of soybean seeds.",
  "references": null
}