{
  "paperId": "b2f69dba4768f9aaa6b86eba7cd0ba0e707d21ce",
  "externalIds": {
    "DOI": "10.22543/0090-0222.2313",
    "CorpusId": 204318671
  },
  "url": "https://www.semanticscholar.org/paper/b2f69dba4768f9aaa6b86eba7cd0ba0e707d21ce",
  "title": "Regional Caddisfly (Trichoptera) Indicator Species for Mid-Order Michigan and Minnesota Streams",
  "venue": "Great Lakes Entomologist",
  "year": 2018,
  "citationCount": 1,
  "influentialCitationCount": 0,
  "openAccessPdf": {
    "url": "https://scholar.valpo.edu/cgi/viewcontent.cgi?article=2313&context=tgle",
    "status": "BRONZE",
    "license": null,
    "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'references'}. Paper or abstract available at https://api.unpaywall.org/v2/10.22543/0090-0222.2313?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.22543/0090-0222.2313, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "fieldsOfStudy": null,
  "publicationTypes": [
    "JournalArticle"
  ],
  "authors": [
    {
      "authorId": "50427088",
      "name": "D. Houghton"
    }
  ],
  "abstract": "Nearly 150,000 caddisfly specimens representing 238 species were analyzed from 166 5–15m wide streams within Michigan and Minnesota to determine the characteristic indicator species of 5 previously-established regions of caddisfly biological diversity. Based on a combination of relative frequency and abundance, 35 of these species indicated a particular region or regions. Indicator species in forested regions constituted a balance of trophic functional groups, whereas indicator species from agricultural regions were dominated by filtering collectors. While it was difficult to determine if species were indicating natural habitat type or differences in anthropogenic disturbance, establishing indicator species now will render potential future changes to the fauna easier to evaluate. ____________________ Indicator species are those that define particular ecosystems or habitat types. Indicator values for species are determined by combining their relative frequency in an ecosystem with their relative abundance in that ecosystem into an overall indicator value (Dufrêne and Legendre 1997). Knowing indicator species is important for biological assessment because information about an ecosystem can be inferred from the species that are indicative of it, and because changes in indicator species populations will likely reflect changes in the ecosystem that might otherwise be difficult to detect. This note determines indicator values for caddisflies (Trichoptera) in the determined caddisfly regions of Michigan and Minnesota. Caddisflies are taxonomically abundant and ecologically diverse in nearly all types of freshwater ecosystems (Mackay and Wiggins 1979). These traits, coupled with their differing tolerances to various types of ecological disturbances, render caddisflies important in biological water quality monitoring (Dohet 2002). Michigan and Minnesota have both been rigorously sampled for adult caddisflies during the last 15 years using light traps (Houghton 2015). This technique consists of an 8 watt ultraviolet light placed over a white pan filled with ethanol and set near an aquatic habitat for 2 hours starting at dusk. While not intended to be an exhaustive technique, maintaining consistent bulb wattage, pan size, weather conditions, and time interval allows for quantitative comparisons between samples of the nocturnally active species (Wright et al. 2013). Based on 79 samples from Michigan and 87 from Minnesota, mid-order (5–15 m wide) streams of both states were previously ordinated into 5 distinct regions of caddisfly biological diversity, with latitude, stream gradient, and relative upstream habitat disturbance determined as the most important variables affecting overall caddisfly assemblages (Fig. 1) (Houghton 2015). These regions have higher value at partitioning the caddisfly fauna into distinct groups than do traditional landscape delineations such as watershed or biotic province and, thus, are the appropriate sampling units for caddisflies in the two states (Houghton 1Department of Biology, Hillsdale College, 33 East College Street, Hillsdale, MI 49242. david.houghton.hillsdale.edu. 1 Houghton: Regional Caddisfly (Trichoptera) Indicator Species for Mid-Order Published by ValpoScholar, 2015 94 THE GREAT LAKES ENTOMOLOGIST Vol. 48, Nos. 1 2 2003). The purpose of this note was to determine indicator values for the individual species that indicated these particular established regions. Michigan specimens were collected from 2009–2013 and are stored in the Hillsdale College Insect Collection. Minnesota specimens were collected from 1999–2001 and are stored in the University of Minnesota Insect Museum. Species were tested for their value as indicator species using Dufrêne and Legendre’s (1997) indicator species technique using the program PC-ORD for Windows (McCune and Medford 2006). This method determines a species’ indicator value based on a combination of the percentage of streams within a region that contain a particular species, and the average abundance of that species within each region divided by the average abundance of that species in all regions. Combining these frequency and abundance values yields an overall indicator value, which is expressed as a percentage of perfect indication. Thus, in order to be a significant indicator, a species needs to be common and abundant in some ecosystems but not in others. A monte carlo test determines the significance of determined indicator values (McCune and Medford 2006). A total of 148,238 specimens were analyzed in both states combined. Of the 238 species tested, 35 had significant indicator values for a particular region (Table 1). Several species indicated >1 region. Indicator species of streams in the Northern Great Lakes and Northern Forested regions were of a mix of trophic functional groups. This pattern was expected by the river continuum concept (Vannote et al. 1980), which predicts a balanced assemblage of trophic functional groups in mid-order streams. Conversely, indicator species were >80% filtering Figure 1. The 5 caddisfly regions of Michigan and Minnesota as determined by Houghton (2015) relative to geographic location and land use. Land use data from the 2006 USGS National Land Cover Database (www.mrlc.gov). 2 The Great Lakes Entomologist, Vol. 48, No. 1 [2015], Art. 7 https://scholar.valpo.edu/tgle/vol48/iss1/7 2015 THE GREAT LAKES ENTOMOLOGIST 95 Table 1. Overall indicator values (IV) and associated P values for the 35 significant indicators of medium streams within the five caddisfly regions (NGL: Northern Great Lakes, NF: Northern Forested, NM: Northwestern Minnesota, SA: Southern Agricultural, SM: Southeastern Minnesota) (Figure 1). Numbers below regions denote the percentage of perfect indication based on a combination of species relative abundance and relative frequency in a particular region. Species are arranged in approximate descending IV value for each region, although some overlap exists for species indicating multiple regions. Trophic functional groups: AP: algal piercer, FC: filtering collector, GC: gathering collector, Sc: scraper, Sh: shredder, Pr: predator. Species Group IV P NGL NF NM SA SM Dolophilodes distinctus (Walker) FC 51.7 0.000 52 3 0 0 0 Hydropsyche sparna Ross AP 39.8 0.002 40 13 0 0 3 Hydroptila valhalla Denning AP 35.0 0.002 35 3 0 0 0 Molanna blenda Sibley Sc 32.1 0.002 32 4 0 0 0 Rhyacophila fuscula (Walker) Pr 31.4 0.002 31 0 0 0 0 Hydropsyche walkeri Betten and FC 26.8 0.004 27 0 0 0 0 Mosely Cheumatopsyche gracilis (Banks) FC 26.1 0.014 26 5 0 0 5 Polycentropus centralis Banks Pr 25.2 0.028 25 0 0 0 0 Hydroptila antennopedia Sykora AP 21.6 0.009 22 0 0 0 0 and Harris Agrypnia improba (Hagen) Sh 22.5 0.026 22 7 0 0 0 Hydroptila ampoda Ross AP 19.6 0.015 20 0 0 0 0 Limnhephilus ornatus Banks Sh 18.5 0.038 18 5 0 0 0 Limnephilus moestus Banks Sh 39.0 0.001 39 15 0 2 0 Lepidostoma togatum (Hagen) Sh 34.4 0.000 34 19 0 0 3 Banksiola crotchi (Banks) Sh 29.9 0.010 30 29 1 1 0 Glossosoma nigrior Banks Sc 20.8 0.048 21 10 0 0 0 Hydroptila jackmanni Blickle AP 22.6 0.042 12 10 0 0 1 Oxyethira forcipata Mosely AP 26.9 0.002 4 27 0 2 1 Hydroptila wyomyia Denning AP 20.9 0.022 10 21 0 0 0 Oxyethira rivicola Blickle and Morse AP 20.7 0.028 2 21 0 0 0 Cheumatopsyche speciosa Banks FC 92.9 0.000 0 0 93 0 0 Ceraclea flava (Banks) GC 54.4 0.000 0 1 54 0 0 Hydropsyche confusa Walker FC 37.5 0.000 0 0 38 0 0 Potamyia flava (Hagen) FC 62.1 0.000 0 0 62 32 0 Hydropsyche bidens Ross FC 60.2 0.000 0 0 60 10 0 Hydropsyche simulans Ross FC 56.9 0.000 0 0 57 25 0 Hydroptila ajax Ross AP 20.7 0.006 0 0 0 21 0 Cheumatopsyche campyla Ross FC 18.4 0.047 0 3 2 18 0 Hydropsyche placoda Ross FC 18.1 0.018 0 1 0 18 0 Brachycentrus americanus (Banks) FC 50.5 0.000 3 4 0 0 51 Glossosoma intermedium Banks Sc 49.7 0.000 0 0 0 0 50 Micrasema gelidum McLachlan FC 44.4 0.000 0 0 0 0 44 Hydropsyche alhedra Ross FC 39.1 0.000 1 1 0 1 39 Hydropsyche slossonae (Banks) FC 36.1 0.002 13 7 0 0 36 Hydroptila consimilis Morton AP 23.3 0.032 7 3 0 5 23 3 Houghton: Regional Caddisfly (Trichoptera) Indicator Species for Mid-Order Published by ValpoScholar, 2015 96 THE GREAT LAKES ENTOMOLOGIST Vol. 48, Nos. 1 2 collectors in the Southern Agricultural and Northwestern Minnesota regions, and 67% in the Southeastern Minnesota region. Agricultural disturbance is higher in these regions than it is in the Northern Great Lakes and Northern Forested regions (Fig. 1) (see Houghton 2007 for an in-depth discussion of land use in these regions). In the absence of historical data, it is difficult to determine if species in this note are indicating natural habitat type or differences in anthropogenic disturbance. While I suspect both factors have an important influence on caddisfly assemblages, indication of anthropogenic disturbance may be the more important use of these indicator species data going forward. In both prairie and forested habitats, a caddisfly assemblage characterized by filtering collectors has been shown to reflect agricultural disturbance of the surrounding watershed (Whiles et al. 2000, Gage et al., 2004, Houghton 2007). More specifically, streams of northwestern Minnesota changed during the increase in agricultural land use of 1950–1985 from those containing a balance of functional groups to those dominated by filtering collectors (Houghton and Holzenthal 2010). Now that characteristic indicator species have been determined for the 5 caddisfly regions of Michigan and Minnesota, any future changes to the assemblages would likely reflect changes in watershed integrity. Thus, by establishing the characteristic caddisfly indicator species of these regions now, any future changes to the fauna and associated watersheds can be evaluated with greater precision and confidence.",
  "references": null
}