{
  "paperId": "b68166bcce806aabdf56b398db0da33024ab65c2",
  "externalIds": {
    "DBLP": "conf/giots/MonteleoneMM19",
    "MAG": "2964325798",
    "DOI": "10.1109/GIOTS.2019.8766384",
    "CorpusId": 198144863
  },
  "url": "https://www.semanticscholar.org/paper/b68166bcce806aabdf56b398db0da33024ab65c2",
  "title": "Analysis of the variables that affect the intention to adopt Precision Agriculture for smart water management in Agriculture 4.0 context",
  "venue": "Global Internet of Things Summit",
  "year": 2019,
  "citationCount": 31,
  "influentialCitationCount": 2,
  "openAccessPdf": {
    "url": "",
    "status": null,
    "license": null,
    "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'references'}. Paper or abstract available at https://api.unpaywall.org/v2/10.1109/GIOTS.2019.8766384?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1109/GIOTS.2019.8766384, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "fieldsOfStudy": [
    "Computer Science"
  ],
  "publicationTypes": [
    "JournalArticle",
    "Review"
  ],
  "authors": [
    {
      "authorId": "87701225",
      "name": "S. Monteleone"
    },
    {
      "authorId": "2058847887",
      "name": "Edmilson Alves de Moraes"
    },
    {
      "authorId": "3196763",
      "name": "R. Maia"
    }
  ],
  "abstract": "This work, developed within SWAMP project, presents a conceptual model to analyze the variables that affect the adoption of Precision Agriculture technologies for smart water management in the context of Agriculture 4.0. Through the literature review a conceptual model is proposed that, based on the Internet of Things, Theory of Planned Behavior and Agriculture 4.0, allows predicting and explaining the studied behavior. The model allows analyzing the impact of several actions that can be implemented by the different actors operating in the farm ecosystem. From this model it is possible to define a data model that relates the measures associated to each identified variable, with focus on operations planning and irrigation scheduling. The proposed models show that IoT and Industry 4.0 methods can bring great improvements in planning, control and optimization of agricultural operations and smart water management",
  "references": null
}