{
  "paperId": "b737d127e0919e6470646a347e40869d10d985b5",
  "externalIds": {
    "DOI": "10.22543/0090-0222.2261",
    "CorpusId": 55291798
  },
  "url": "https://www.semanticscholar.org/paper/b737d127e0919e6470646a347e40869d10d985b5",
  "title": "Discontinuity in the Insect Assemblages of a Northern Lower Michigan Stream",
  "venue": "Great Lakes Entomologist",
  "year": 2018,
  "citationCount": 1,
  "influentialCitationCount": 0,
  "openAccessPdf": {
    "url": "https://scholar.valpo.edu/cgi/viewcontent.cgi?article=2261&context=tgle",
    "status": "BRONZE",
    "license": null,
    "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'references'}. Paper or abstract available at https://api.unpaywall.org/v2/10.22543/0090-0222.2261?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.22543/0090-0222.2261, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "fieldsOfStudy": null,
  "publicationTypes": [
    "JournalArticle"
  ],
  "authors": [
    {
      "authorId": "50427088",
      "name": "D. Houghton"
    },
    {
      "authorId": "35606539",
      "name": "Constance M. Brandin"
    },
    {
      "authorId": "2065627343",
      "name": "L. Reynolds"
    },
    {
      "authorId": "116345880",
      "name": "Lindsey L. Elzinga"
    }
  ],
  "abstract": "We assessed the physicochemical and biological continuity of a 2nd–4th order reach of the Little Manistee River in northern Lower Michigan. Contrary to typical woodland streams, the downstream sites of the river were covered with a dense riparian canopy, whereas the upstream sites were devoid of this canopy due to historical (≥10 ybp) agriculture. Other than slight changes in water temperature and dissolved oxygen, there were no appreciable differences in measured water physicochemistry between the canopied and non-canopied sites. The stream, however, appeared biologically discontinuous as indicated by lower shredder abundance and higher filtering collector abundance at the upstream (non-canopied) sites for both benthic macroinvertebrate and adult caddisfly assemblages. Benthic scraper abundance was, likewise, higher in the upstream sites. Our results suggest that changes in riparian canopy alone can lead to changes in biological assemblages, even without obvious changes in water physicochemistry. ____________________ The river continuum concept (Vannote et al. 1980) describes a predictable pattern of gradual changes in river morphometrics and organismal assemblages as width increases and the river interacts with its riparian corridor. Anthropogenic disturbances, however, may disrupt this continuum, particularly in small–medium streams (Pringle et al. 1993; Delong and Brusven 1993, 1998; Houghton 2006, 2007). Removal of the riparian canopy cover, for example, may cause a loss of coarse allochthonous input needed by invertebrate shredders (Sabater et al. 2000, Warren et al. 2007). Agricultural streams in particular have concentrations of sediment, nutrient, and fine organic matter input hundreds of times higher than undisturbed streams (Royer et al. 2004, Inwood at al. 2005). Riparian habitat loss, with subsequent increases in nutrient and sediment input, has been repeatedly found to be the most widespread stressor of streams in the U.S. generally, in the Plains and Lowlands region of the U.S., and in Michigan (Paulsen at al. 2008, Wang et al. 2008). It is difficult to separate the habitat loss and sediment input components of riparian disturbance, as they frequently occur together. Several recent studies of agricultural watersheds, however, have noted positive correlations between the amount of intact riparian vegetation and the biological diversity in the adjacent streams (Houghton 2004a, Rios and Baily 2006, Urban et al. 2006). More specifically, Houghton et al. (2011a) found that sites in a southern Michigan agricultural stream protected by riparian canopy had 3× the number of adult caddisfly species as sites without canopy, even though physicochemistry remained unchanged and typical of agricultural streams. These studies suggest the hypothesis that both riparian habitat loss and increases in sediment 3Department of Biology, 33 East College Street, Hillsdale College, Hillsdale, MI 49242. (e-mail: david.houghton@hillsdale.edu). 1 Houghton et al.: Discontinuity in the Insect Assemblages of a Northern Lower Michi Published by ValpoScholar, 2013 32 THE GREAT LAKES ENTOMOLOGIST Vol. 46, Nos. 1 2 input are individually important for affecting stream biota. The purpose of our study, therefore, was to test this hypothesis by observing the effects of riparian canopy loss on stream macroinvertebrate assemblages in a stream without obvious sediment input. Materials and Methods Study site. The Little Manistee River is located in the northwestern portion of the Lower Peninsula of Michigan. It is approximately 100 km in length and drains a watershed of approximately 1100 km2 before draining into Lake Michigan. Over half of the watershed is officially protected by the Manistee National Forest and the Pere Marquette State Forest, and much of the remaining land is also undeveloped (Fig. 1). Due to its relatively undisturbed watershed and stable groundwater input, it is one of the coldest and most stable streams in the Lower Peninsula (Tonello 2005). It hosts potomadromous spawning runs of steelhead [Oncorhynchus mykiss (Walbaum)], Chinook salmon [Oncorhynchus tshawytscha (Walbaum)], and brown trout [Salmo trutta Linnaeus] from Lake Michigan, and contains breeding populations of brook trout [Salvelinus fontinalis (Mitchell)] (Seelbach 1993). Although much of the watershed is protected, the headwaters of the Little Manistee are primarily composed of pasture and feral fields (Tonello 2005). From our observations, it has been ~10 years since the upper watershed was under active cultivation. Five sites were sampled on the Little Manistee during this study. Sites 1–2 were located in the non-canopied headwaters region and sites 3–5 were all within the forested State and National Forest land (Fig. 1). All 5 sites were Figure. 1. Aerial photograph (Google Earth) of the study area showing the location of the Little Manistee River, its important tributaries, and the location and photographs of our five collecting sites. Green areas denote forest, whereas lighter brown areas denote agriculture, feral fields, or urban landuse. 2 The Great Lakes Entomologist, Vol. 46, No. 1 [2013], Art. 3 https://scholar.valpo.edu/tgle/vol46/iss1/3 2013 THE GREAT LAKES ENTOMOLOGIST 33 within a stream reach of 10 km. All sites were upstream from major tributaries. Stream width ranged from 3 m (2nd order) in the upper sites to 10-12 m (4th order) at the lower sites. Determination of the extent of canopy cover was from aerial maps and visual inspection. Except for the occasional alder (Alnus sp.) along the banks, non-canopied areas of both streams were almost devoid of plants > 2 m in height within 100 m of either bank. Thus, the distinction between ‘canopied’ and ‘non-canopied’ sites was distinct enough that further quantification and precision were deemed unnecessary. Physicochemical sampling. Physicochemical measurements were made twice during June and once monthly from July through September 2011. Six sets of measurements were made from each site on each date. Conductivity (ECTestr Low, Eutech Instruments), pH (AccuMet AP61, Fisher Scientific), dissolved oxygen (YSI-55, YSI Environmental), and temperature (YSI-55, YSI Environmental) measurements were all made on-site. All measurements were made within 2 h of each other to minimize diel fluctuations. Benthic macroinvertebrate sampling. Benthic macroinvertebrates were sampled using Hess samplers with 0.3 m2 areas (Barbour et al. 1999). Six Hess samples were taken from each site of each stream within a diversity of habitats. Sites 1, 2, and 4 were sampled during May 2010 and sites 3 and 5 were sampled in May 2011. All benthic specimens were identified to the lowest identifiable taxon, typically genus, after Hilsenhoff (1995). Adult caddisfly sampling. Adult caddisflies were sampled using ultraviolet light traps, which consisted of an 8-watt ultraviolet light placed over a white pan filled with 70% ethanol. Each trap was placed within 2 m of a sampling site at dusk and retrieved approximately two hours later. By standardizing the time of collection, wattage of the light source, and size of collecting pan, the technique yielded quantitative samples of the nocturnally active caddisfly adults and allowed for comparisons between sites (Houghton 2004a). To standardize weather conditions, samples were collected only if the peak daytime temperature was > 22°C, dusk temperature was >13°C, and there was no noticeable wind or precipitation at dusk. Sampling occurred approximately bi-weekly during June and July 2011, the peak emergence period of caddisflies in northern Michigan (Houghton et al. 2011b), for a total of 5 samples from each site. All adult specimens were identified to species after Houghton (2012), except for females of Hydroptilidae, Hydropsychidae, and Polycentropodidae, which lack the characters necessary for doing so. Such specimens were not included in any analyses. Data analyses. Specimens of both benthic invertebrates and adult caddisflies were placed into trophic functional groups following Merritt et al. (2008). Algal piercers were considered gathering collectors in analyses. Mean percentages of the functional groups informative of stream condition at each site: scrapers, shredders, and filtering collectors (e.g., Allan 1995, Houghton 2007), were compared to each other by a one-way Analysis of Variance. Percentages were transformed through an ArcSine function before analysis (Zar 2007). Mean water physicochemical values were compared using a 2-way Analysis of Variance to determine differences between both sampling site and sampling day. Sampling sites were examined for patterns in their benthic macroinvertebrate and adult caddisfly assemblages with Detrended Correspondence Analysis (DCA) using the program PC-ORD for Windows® (McCune and Grace 2002). The DCA analysis was performed on a two-dimensional data matrix of sampling sites by taxa relative abundance values. Relative abundances were determined by counting the number of specimens collected at each site and then coding 0 specimens as ‘0’, 1–10 as ‘1’, 11–100 as ‘2’, 101–1000 as ‘3’, and 1001–10,000 as ‘4’. Since data coding accounted for variation in specimen abundance between sites, it was a more powerful measure than simple presence or absence data (Feminella 2000, Houghton 2004a). Coding on a log10 scale mitigated the effects 3 Houghton et al.: Discontinuity in the Insect Assemblages of a Northern Lower Michi Published by ValpoScholar, 2013 34 THE GREAT LAKES ENTOMOLOGIST Vol. 46, Nos. 1 2 of outlier samples often associated with light-trapping data, as well as the influence of highly abundant species (Cao et al. 1997, Houghton 2004a, Houghton et al. 2011b). All taxa were weighted equally in each analysis.",
  "references": null
}