{
  "paperId": "cfa4c471e143b5af09c944a3838fe59c954e1bf2",
  "externalIds": {
    "MAG": "2321661854",
    "DOI": "10.3390/WSF3-H002",
    "CorpusId": 54785426
  },
  "url": "https://www.semanticscholar.org/paper/cfa4c471e143b5af09c944a3838fe59c954e1bf2",
  "title": "Precision Farming Technology like the Tool of the Sustainable Agriculture in the Hungarian Practice",
  "venue": "",
  "year": 2013,
  "citationCount": 0,
  "influentialCitationCount": 0,
  "openAccessPdf": {
    "url": "https://sciforum.net/paper/download/2285/manuscript",
    "status": "HYBRID",
    "license": "CCBY",
    "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.3390/WSF3-H002?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.3390/WSF3-H002, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "fieldsOfStudy": [
    "Environmental Science"
  ],
  "publicationTypes": [
    "Review"
  ],
  "authors": [
    {
      "authorId": "87242300",
      "name": "E. Lencsés"
    },
    {
      "authorId": "1405317678",
      "name": "K. Takács-György"
    }
  ],
  "abstract": "Modern plant production systems are faced to numerous challenges, for example, they have to satisfy the growing food necessity with moderate environmental damage and to produce quality product with profit. The support of the food needs cannot be solved by giving up the chemicals. Many new or rediscovered technologies have appeared against the harmful effects of the chemicalization of the agricultural production without yield loss or with yield similarity (for example ecological, mid-tech farming and precision farming technologies). Precision farming technology should not be considered as only a modern plant production technology or only a new agro-management tool. In our opinion the precision farming technology is achieved only when the results of electronic and IT equipment are realized and can be differentiated in the variable rate treatments zone-by-zone. The biggest problem with the precision farming technology according to our opinion is that the possible advantages and disadvantages of the technology highly depend on the professional knowledge and attitude of the manager and the staff. Between the autumn 2010 and spring 2011 the own data collection was made for examining the knowledge about the precision farming technology among Hungarian farmers producing field crops. Some interviewed farmers have used precision farming technology for years, some have planned to adopt this technology and some have heard about the technology but does not want to use it. Adaptation of precision farming technology may bring both advantages and disadvantages. According to the scientific literature sources the most important advantage of precision farming technology is the decreasing of the negative environmental impacts. In the survey, non-precision farmers placed this advantage in the 1st place, according to the precision farming planners it was in the 2nd place, while according to the precision farmers this impact was only on the 8th place. Furthermore we examined the opinion of the farmers about the changes in percentages of operational cost, herbicide cost, fertilizer cost and human resource cost resulted by the adaptation of precision farming technology compared to the conventional technology. I used the box-plot analysis for this examination. In summary the biggest cost saving were in the fertilizer cost and herbicide cost according to the opinion of precision farmers.",
  "references": [
    {
      "paperId": "3911342372452b9d7c9e51afb78c17f9fbeb9edb"
    },
    {
      "paperId": "ed33e4499cecf5b8356df7f1a4218ac308bab79f"
    },
    {
      "paperId": "7da8a6a359f4a19dceb2c0df1fb3d34f9e3eb02f"
    },
    {
      "paperId": "26b8dbe5fa6b43382465db33aea7bdf0e6a96c6f"
    },
    {
      "paperId": "25806b31850850e6a977437a92e6a65935e69346"
    },
    {
      "paperId": "9d20a9935777b23fe4d74cd268e8092b32ebc7d1"
    },
    {
      "paperId": "1aea5198ac46b8cb128cca6f8ca74fdd59e754b3"
    },
    {
      "paperId": "21dfe98f3510e64b35ee3bcb8a999ddc3b87b5ed"
    },
    {
      "paperId": "f6eba731cb7e00fd271736ce18909ed63ff5e2db"
    },
    {
      "paperId": "a3071e13e083724739d3ba5db0797919a3b58cd9"
    },
    {
      "paperId": "03d884cab892e0e0af0e8c85d25cda05ab9d3957"
    },
    {
      "paperId": "bccbc20c001dcc51f5b9f84c6af691cd4f066281"
    },
    {
      "paperId": "065b7e09cc81e44d5f7912e6aaf7d551f3770532"
    },
    {
      "paperId": "5ea96ea3be15ea59815a42915c24cffd93761f8e"
    },
    {
      "paperId": "cd346cc50f4e50fba59b12f969a7b5a04635e01f"
    },
    {
      "paperId": "8d7c0adfe8025a2898920fe5b6faaba36a1b7cca"
    },
    {
      "paperId": "99d8867b5e84a50728ce2ffedeb1843b79bfe94a"
    },
    {
      "paperId": "874e6a03519cbcad18a48a00359bb3c861e046aa"
    },
    {
      "paperId": "a13121ab649d01a24b56b0e49ffe6a1acf55c71f"
    },
    {
      "paperId": "bba7459ad9cd25d1a95ab19c4e11b1089b50e8e8"
    },
    {
      "paperId": "fb5ef3bb3fc3007fac2af896937694e152d023d2"
    },
    {
      "paperId": "5b0ccc4d8d207e35f5d4d5a55c4355b59491a070"
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    },
    {
      "paperId": null
    }
  ]
}