{
  "paperId": "ecd9aee21853e26c6f337a47ddf663d83e348d4a",
  "externalIds": {
    "MAG": "2896707092",
    "DOI": "10.1109/ICMA.2018.8484450",
    "CorpusId": 52929666
  },
  "url": "https://www.semanticscholar.org/paper/ecd9aee21853e26c6f337a47ddf663d83e348d4a",
  "title": "Research on Intelligent Monitoring System of Greenhouse Intensity and CO2 Concentration Based on STM32",
  "venue": "2018 IEEE International Conference on Mechatronics and Automation (ICMA)",
  "year": 2018,
  "citationCount": 2,
  "influentialCitationCount": 0,
  "openAccessPdf": {
    "url": "",
    "status": "CLOSED",
    "license": null,
    "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'references'}. Paper or abstract available at https://api.unpaywall.org/v2/10.1109/ICMA.2018.8484450?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1109/ICMA.2018.8484450, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "fieldsOfStudy": [
    "Environmental Science"
  ],
  "publicationTypes": [
    "Conference"
  ],
  "authors": [
    {
      "authorId": "2116573615",
      "name": "Shu-jun Li"
    }
  ],
  "abstract": "Because the stability and accuracy of the traditional greenhouse monitoring system are not high enough, the light intensity and the grape canopy of the intelligent monitoring system are established for this phenomenon. It is based on the CO2 concentration of STM32 single chip to monitor the intensity of light and CO2 concentration and show it at the same time. Serial communication is used to send test results to MCGS touch screen to achieve real-time monitoring and warning of light intensity and CO2 concentration in greenhouse. The result of long term test shows the precision of the light intensity detection of the system is 9401ux, CO2 concentration measurement accuracy 40ppm. Compared with the traditional automatic monitoring system, the system runs stably and costs less, and the accuracy meets the requirements of grape greenhouse. In conclusion, the system proposed in this paper is suitable for agriculture.",
  "references": null
}