{
  "paperId": "ef517039236518cafcd0f86214924f37d7e4d94a",
  "externalIds": {
    "MAG": "2960202475",
    "DOI": "10.1093/OSO/9780198717263.003.0008",
    "CorpusId": 199110398
  },
  "url": "https://www.semanticscholar.org/paper/ef517039236518cafcd0f86214924f37d7e4d94a",
  "title": "Satellite remote sensing to support agriculture and forestry",
  "venue": "Satellite Remote Sensing and the Management of Natural Resources",
  "year": 2019,
  "citationCount": 1,
  "influentialCitationCount": 0,
  "openAccessPdf": {
    "url": "",
    "status": null,
    "license": null,
    "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'references'}. Paper or abstract available at https://api.unpaywall.org/v2/10.1093/OSO/9780198717263.003.0008?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1093/OSO/9780198717263.003.0008, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "fieldsOfStudy": [
    "Environmental Science"
  ],
  "publicationTypes": [
    "Review"
  ],
  "authors": [
    {
      "authorId": "1962811",
      "name": "N. Pettorelli"
    }
  ],
  "abstract": "This chapter presents a comprehensive overview of how satellite data can be used to support agriculture and forestry. The first two parts explore how satellite imagery can be used to monitor forests and crops, looking at opportunities to track changes in parameters such as tree height, tree ring width, and tree mortality from space, and reviewing how satellite data can be used for crop phenology and crop disease monitoring, as well as for crop yield measurements and predictions. The next sections focus on satellite remote sensing as a way to improve practices, discussing how satellite remote sensing technology can provide information on soil properties and inform management through the assessment of plant physiological status. The chapter concludes by discussing the role of satellite remote sensing in the context of precision farming and sustainable land use, and its possible contribution toward developing management practices at the field level to maximise economic output and to reduce adverse impact on the environment.",
  "references": null
}