{
  "paperId": "fbaadbc0f38dbcdf16359a1b4f36bc50fc53b02f",
  "externalIds": {
    "MAG": "2911761000",
    "DOI": "10.1002/ird.2334",
    "CorpusId": 116857306
  },
  "url": "https://www.semanticscholar.org/paper/fbaadbc0f38dbcdf16359a1b4f36bc50fc53b02f",
  "title": "Innovative and Sustainable Water Management: Adapting to a Variable and Changing Climate",
  "venue": "Irrigation and Drainage",
  "year": 2019,
  "citationCount": 1,
  "influentialCitationCount": 0,
  "openAccessPdf": {
    "url": "",
    "status": "CLOSED",
    "license": null,
    "disclaimer": "Notice: The following paper fields have been elided by the publisher: {'references'}. Paper or abstract available at https://api.unpaywall.org/v2/10.1002/ird.2334?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1002/ird.2334, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
  },
  "fieldsOfStudy": [
    "Business"
  ],
  "publicationTypes": [
    "Review"
  ],
  "authors": [
    {
      "authorId": "145107392",
      "name": "E. A. Pandya"
    }
  ],
  "abstract": "The worldwide population is expected to rise to 9.6 billion by 2050 and that may require the agricultural production to increase by 60% over the 2005–2007 base given the variable and changing climate to cope with issues related with global food security. The International Commission on Irrigation and Drainage (ICID) traditionally focuses on themes related to agricultural water management that address issues of current global concerns, in its international conferences. The ICID’s International Conference in 2018, consequently, focused on ‘Innovation and Sustainable Agri-water Management: Adapting to a Variable and Changing Climate’ during 12–17 August 2018 in the city of Saskatoon in Canada with relevant three Sub-themes, namely: (1) Competing Water Demands; (2) Resilient Agriculture – Adapting Agriculture to Climate Change; and (3) Irrigation and Drainage in Perspective. Canada has enormous water supplies, but it’s distribution is spatially variable and water resources are at risk because of climate change. Climate change related risks include higher temperatures, lower lake levels, declining glaciers, expanding forest fires, changes from snowmelt driven flooding to summer rainfall flooding, changes in permafrost and collapse of infrastructure associated with that. The Global Water Futures (GWF) aims to provide solutions to water threats in the era of global change; both in terms of science and needs for the economy and to adapt to changing conditions. Agricultural research takes place on the Canadian prairies (wetland drainage, intensive agriculture) and in the great Lakes area (water quality, drainage issues, crop management). The mountain water research is of particular importance to other water for food impacts, as the water generated in the mountains (‘Water Towers’) feeds about 56% of the global population, Dr. John Pomeroy (Canada) observed in the plenary session. Dr Peter McCornick (USA) reflected on water management for productive and resilient agriculture. Climate change is not the only issue we faced in feeding the world: restrictions on land and water are largely drive changes in agricultural practices, he said. Dr Maurice Maloney spoke of the engineering of plants as another method to deliver global food security. We need to grow more food in the next 50 years then we have ever cumulatively since humans emerged, he observed. In the Plenary session, two basic main concerns were highlighted. Firstly, the growing challenges of climate change leading to extreme flood and drought events and secondly, the food security threat for the growing population stemming from unsustainable water use globally. From the Canadian perspective, it was shared that to bring resiliency in the water and agricultural sector, a water security strategy and efficient water management in agriculture were the key requirements. Experts discussed the crop growth technology, productivity, socio-economic value of irrigation, water-food-energy nexus, climate change mitigation and water quality management for efficient agricultural production. The concurrent sessions of the international conference focussed on drainage and flood control strategies, irrigation, drainage and flood control for resilient agriculture, irrigation infrastructure development and climate-smart agriculture and innovative technologies for enhancing water use efficiencies. With relevant examples presented from the Dutch water management systems, the successful approach of keeping lowlands dry for agricultural production was presented. Exceptional irrigation examples of Saskatchewan were also discussed. Combating the severe challenges posed by climate change, an emphasis on creating more robust water infrastructure was highlighted. In other sessions, the role of tools and technologies in increasing the irrigation efficiency was discussed. Modern techniques such as precision agriculture, use of soft computing used for decision support systems, use of remote sensing and geospatial data in combination with the field measurements were discussed at length during these sessions. Agriculture and Agri-Food Canada (AFFC) hosted a workshop on the Agricultural Greenhouse Gas Program administered by AAFC. The workshop featured several presentations who provided an overview of the various research efforts and studies which were carried out under the program. During the conference, FAO conducted sessions on ‘Hydro-economic modelling for transboundary river basin management – towards more Integrated approaches’ and ‘Data-driven improvement of water use efficiency in Small-scale Irrigation.’ The former session deliberated on the challenges pertaining to the sectors competing with agriculture, especially hydropower, particularly in the transboundary regions. Additionally, solutions such as IRRIGATION AND DRAINAGE",
  "references": null
}